{
    "Name":"Amnesia Haze",
    "Info":"Finest Medicinal Seeds",
    "Type" : "mostly Sativa",
    "Origins":"Super Silver Haze x Cambodian",
    "Genetics":"",
    "Flowering":"10 weeks",
    "Harvest": "mid October",
    "Potency":"",
    "Height": "",
    "Yield":"800 grams per square meter",
    "THC": "15-20%",
    "Breeder":"",
    "others":[],
    "Contents":[
        "Finest Medicinal Seeds are pretty serious in their dedication to the medical marijuana community in Canada. Not only do they produce the great mag Treating Yourself, which dispenses information and guidance about how to grow, use and find the best medical weed, but they also sell high quality seeds to ensure that anyone can get hold of quality product in their own home.",
        "If that wasn’t enough, they also create some fantastic strains, one of which is Amnesia Haze. A cross between a Super Silver Haze plant and a Cambodian sativa, this strain comprises some amazing genetics and is much lauded for its strong medicinal qualities as well as its ability to get you totally high!",
        "Amnesia Haze is a particularly resilient strain and can be saved from a lot of rookie errors if they are dealt with quite quickly, so if you find that you’ve over watered in the early stages, give the plant enough time to dry out and then get onto a normal watering schedule.",
        "The Cambodia parent plant of this strain is a landrace sativa, and the genetics of the plant mean that Amnesia Haze can grow very tall and leggy unless trained properly in an indoor grow. You might decide to grow this one outdoors, as the extra room and increased growth will also give a healthier yield up to a crazy 900 grams per plant, if optimum conditions are reached. That alone makes this a particularly perfect strain for production on a commercial scale.",
        "Indoors, you can still get a harvest of 800 grams per square yard of grow room if you give the plants lots of light, but extra effort might need to be expended to keep the plants manageable. In both scenarios, the flowering time will be around 10 weeks.",
        "The name of this strain lets you know exactly what its effects will be; you really will find yourself in an Amnesia Haze. Not only will a short-term memory go on a little holiday without telling you or even leaving a note, but your own motormouth and boundless energy will make the whole evening go by in nothing short of a haze. The cerebral effects of Amnesia plants are second to none, and this strain has the added bonus of fighting depression and stimulating the appetite, making it fantastic medicine for a whole range of problems. The psychedelic properties of the Cambodian genetics come through if you overindulge, so if your interest in marijuana is only as medicine, in the spiritual sense, you can also find solace in this strain. Just remember to try and keep one foot in reality – or at least on the doorstep."
      
    ]

}
