{
    "Name":"Anesthesia",
    "Type" : "Indica",
    "Info":"Sannie’s Seeds",
    "Origins":"Afghan Skunk x Herijuana",
    "Genetics":"",
    "Flowering":"64-70 days",
    "Harvest": "",
    "Contents":[
        "Anesthesia was developed specifically to keep the Afghani Skunk alive. A classic among old-school strains, the original Afghani Skunk was passed along to a breeder Whazzup as a clone from a renowned veteran grower who had grown the strain for many years. Sannie’s Herijuana was selected as the father in order to add medicinal strength and a more open structure to the indica density of the Afghani. Anesthesia’s original mother was vegetated outdoors, then pollinated and bloomed in an indoor garden. The result is a smoke with a distinctly earthy Afghan flavor and a deeply relaxing buzz.",
        "Anesthesia starts as a low branchy plant with broad indica leaves. When grown from seed, these plants branch extensively and yield better with ample space, but they still tend to form ane large dense main cola. Anesthesia prefers a calcium-rich substrate, but all growing techniques and mediums are okay. In a sea of green method, gardeners should plant no more than nine plants per square meter. It is also great for screen of green gardens due to the branching and open structure. This wide plant needs generous floor space to reach its full potential. Whazzup recommends 4-5 plants per square meter when grown as multi-branch plants from cuttings. Anesthesia shows gender relatively late. As she enters flowering, the growth speeds up, and she doubles in size, reaching between 3.5 and 4 feet (1 meter) in height.",
        "At maturity, the plants to begin to use less water, the deep green leaves start to yellow, and the buds develop red-brown pistils. Trichomes form a thick carpet on the leaves and buds. They do not at all need to be milky to be harvest ready. Though predominantly indica, the open plant structure and the low leaf ration makes Anesthesia easy to trim. The Herijuana-dominant phenotypes finish first and are also the most compact and most resinous. A separate mixed phenotype finishes a little slower and has the best combination of dark musky taste and potency. Don’t let the modest size of the colas mislead you – their dense chunkiness means they weigh in heavy and explode in the grinder. Since these plants have a tight bud structure, it is best to avoid high humidity during the last weeks of flowering.",
        "Anesthesia is named for the narcotic, body stone that its smoke induces. By definition, “anesthesia” is a state in which awareness of pain or discomfort in the body is reduced, and relaxing or sedative effect is created. The Anesthesia variety causes a deep physical mellowing that slowly works through one’s limbs like a warm blanket, while allowing the mind to stay engaged. As a medicinal strength strain, it may be too potent to be enjoyable for beginners or casual recreational smokers. However, patients who rely on indica body effects but want to stay mentally alert will enjoy the balance of these qualities. The old school taste is earthy and dark, with a hint of coffee tones that will appeal to fans of deep hashy flavors."
    ]

}