{
    "Name":"Angel Heart",
    "Info":"Mr. Nice Seeds",
    "Type" : "mostly Sativa",
    "Origins":"Mango Haze x Afghan Skunk",
    "Genetics":"12.5%NL5, 25%Haze, 25%Afghan and 37.5%Skunk",
    "Flowering":"60-70 days",
    "Harvest": "early October",
    "Potency":"",
    "Height": "",
    "Breeder":"Neville and Shantibaba",
    "THC": "",
    "Yield":"",
    "Contents":[
        "Seed companies are only as good as the breeders they have, so by that maxim, Mr. Nice Seeds must be the top of the table with Shantibaba, Howard Marks and Neville Schoenmaker on their team. As each one is an international cannabis celebrity, it’s no surprise that Mr. Nice Seeds have long been lauded for the quality of their original strains. This exceptional sativa dominant hybrid comes from Mango Haze, an amalgamation of Haze, Northern Lights #5 and Skunk #1 heritage, and Afghan Skunk, which is a cross between an Afghani indica plant and the fabulous Skunk #1.",
        "Angel Heart, a joint project by Neville and Shantibaba, is an adaptable plant and will grow well in almost any setup, whether in indoor hydro grow, an organic garden, an outdoor setup, or in a greenhouse. If you choose to have an indoor crop, allow 60 to 70 days for flowering in order to get the very most out of this strain, and a vegetative period of 5 weeks is normally sufficient to get the results you want.",
        "As this strain is one that is noted for its flavor, consider growing organically to let the natural flavors and traits of the Aghani grandparent come through properly. If any fertilizers or nutrients are used, then growers must flush with distilled water for a minimum of 2 weeks prior to harvest to let the taste really come through. Only with the natural light and quality air of an outdoor grow will Angel Heart reach its aromatic best, though a darkening greenhouse will also suffice.",
        "In the Northern hemisphere harvest will occur at the start of October, and in the Southern hemisphere it should be mid-March. A yield of around 50 grams per square foot of grow room is average, although some phenotypes can produce a much greater weight.",
        "The breeders recommend flowering out a selected mother plant by way of clone, as keeping the seed mother to produce clones may increase the speed at which the plants flower. They also advocate the selection of certain phenotypes that appear, according to personal taste; whichever plants smell the most luscious to you should be the ones you keep – that’s if you can bring yourself to let the other ones go.",
        "This strain produces aromas so sweet that even candy will taste sour afterwards and it is close to perfect in flavor. It is incredibly complex and layered in taste, and though the dried buds smell almost buttery the smoke is very Hazy, with smoky tones of pine and pepper. After the first toke you’ll be ecstatic at having grown such a great taster, and this will only be heightened by the long lasting, motivating high that will probably have you germinating your next batch before the night is out!"
      
    ]

}
