{
    "Name":"Apollo 13BX",
    "Type" : "Sativa 85 / Indica 15",
    "Info":"TGA Seeds",
    "Origins":" Apollo 13 F1 x Vortex",
    "Genetics":"",
    "Flowering":"56 days",
    "Harvest": "",
    "Potency":"",
    "Height": "",
    "Breeder":"",
    "THC": "",
    "Yield":"",
    "Contents":[
        "Apollo 13BX is a West Coast strain that brings together some cannabis from the outer stratosphere. The mother is an Apollo 13 F1, and the father is a strain called Vortex, a cross between Space Queen and Apollo 13X.",
        "This sativa-dominant variety can be grown outside if the weather remains plant friendly through the end of October. Apollo 13BX also lives happily indoors, where it grows in a vine-like-structure that is cooperative in either a screen of green or sea of green system. It can also be grown into large bushy plants so long as the stems are supported. The gardener will need to decide how to tame these plants to best suit the grow space. Apollo 13BX is an agreeable, non-fussy plant, but in order to reach her true yield potential, she needs to be topped and trained. After she is topped, Apollo 13BX likes to grow sideways and can get quite wide. If space is a concern, this flexible plant can be trained to grow vertically using bamboo stakes. The average Apollo 13BX finishes after flowering for 8 weeks.",
        "This plant is a moderate feeder that does not like heavy nutrients but thrives when given a healthy boost in nitrogen. The bud development is almost pod-like, forming long pointy colas at its many budding sites, with the lower buds getting chunkier and more pear-shaped. Apollo 13BX clones well, but the long thin colas take a little extra trim time at harvest.",
        "Apollo 13BX is the type of strain that earns marijuana nicknames like “the fruit”. When cured, these light green buds have a heavy dank smell of overripe fruit, a mixture of rich sultry mangoes and acidic lemons and an underlying pepper tickle that comes through in the aftertaste. This is a motivational strain. With just a few hits, many people are inspired to get stuff done, whether writing, cleaning, working in the yard, taking photos, or getting out on a hike in the great outdoors. It is an up, happy, yet purposeful high that invigorates as well as a cup of good coffee. When used in baked goods, it offers effective pain relief without inducing a nap. The bubble hash is produces makes some growers dream of converting their entire crop."
    ]

}