{
    "Name":"Arjan’s Haze #1",
    "Type" : "Sativa 80 / Indica 20",
    "Info":"Greenhouse Seed Company",
    "Origins":"Neville’s Haze x G-13 Sativa",
    "Genetics":"",
    "Flowering":"77 days",
    "Harvest": "early November",
    "others":[
        
    ],
    "Contents":[
        "Green House Seed Company caters to the haze fan with several strains in this family. Arjan’s Haze #1 is a strong sativa with medium-size internodes, a combination of G-13 and Neville’s Haze. Hazes tend to be a bit leggy, because they branch rapidly, forming a lanky pine tree shape. Ajan’s Haze is in the middle of the haze spectrum and can be kept short by pruning and splitting. The stems are very flexible during vegetative growth, allowing for easy bending and training. Ideally this plant is grown with to plants per square yard.",
        "The best yields for this variety come from hydro systems, but growing in soil will give a smoother taste and a more natural high. It can be grown with sufficient indoor space, or outside in Mediterranean, temperate and subtropical regions. Arjan’s Haze #1 has a very fast metabolism and absorbs more feeding than an average sativa. Green House recommends starting with a low pH (5.5 hydro / 5.7 soil) and slowly increasing to 6.3 at the end of flowering. Maximum EC levels should be 2.1 in hydro and 1.9 in soil. Plants should be flushed in the final stages of flowering.",
        "As haze cultivators know, these sativas require longer grow times. Arjan’s Haze #1 ripens in an average 11 weeks, or late October / early November in the northern hemisphere. When planted in 5-gallon containers, height can be limited to 4-5 feet at maturity. When root development is not limited and ideal conditions are met, this plant can easily reach over 10 feet.",
        "This dark oily green plant has large leaves and huge buds that are quite compact and dense for a sativa, with an irregular shape due to calyx development, and short thick hairs. Its intense sativa aromas – reminding one of moss, forest and musk – are a natural deterrent to pests. The smoke has a background of incense and hard wood, with hints of mint and pepper in flavor.Its strong high creeps up slowly and steadily, reaching a very long peak. It is an uplifting and clearheaded sensation that is ideal for social activities."
    ]

}