{
    "Name":"Arjan’s Haze #2",
    "Type" : "Sativa 90 / Indica 10",
    "Info":"Greenhouse Seed Company",
    "Origins":"Haze x Laos plant",
    "Genetics":"",
    "Flowering":"77 days",
    "Harvest": "early November",
    "others":[
        
    ],
    "Contents":[
        "Arjan’s Haze #2 is a rich dark green near-pure sativa with a haze mama, and a papa hailing from the Southeast Asian country of Laos. With partial heredity in the subtropics, this plant performs best outdoors in the equatorial regions, the Mediterranean, and some mild but temperate regions to the north. Arjan’s Haze #2 has large internodes and lanky branches that tend to shoot out, forming a typical pine-tree shape. It can be acclimated to an indoor grow if the garden space has tall ceilings of if the gardener can apply bending techniques. Her height can also be controlled by limiting root development. In small (2 gal) containers, the plants reaches a mature height of 4-5 feet; in 5-gallon containers she will grow to 9-10 feet. Once flowering, her combo of weighty buds and bendy branches will benefit from staking and support",
        "Green House suggests two plants every two square feet as an ideal grow setup. Arjan’s Haze #2 has a very sativa metabolism, so it absorbs feedings well but does not need high EC levels. The maximum EC should be 1.8 in hydro and 1.6 in soil. Adequate flushing to remove traces of salts should be provided every 10-14 days.",
        "This variety ripens in 11 weeks. Arjan’s Haze #2 tends to keep flowering on the main cola after the lower branches have reached ripeness. Outdoors, it will ripen between the end of October and the beginning of November, reaching heights over 10 feet. Her colas tend to be very long and dense for a sativa, and can have quite irregular shapes due to their wild calyx development. The hairs are thick and long, and the leaves are huge with with 11 leaflets on average at peak growth.",
        "While this strain’s high starts off clear, it is typically followed by a very strong stoned effect that can lead you to feeling rubbery in the knees. Some smokers define it as a “slap in the face” high. It is great for purely recreational activities that are not oo physically taxing or highly focused in nature. Anecdotes suggest that this strain is a good medicinal selection for MS patients. Arjan’s AHze #2 has a very woody flavor that reminds one of wine barrels, musk and insence, with a background scent of lavender."
    ]

}