{
    "Name":"Arjan’s Haze #3",
    "Type" : "Sativa 80 / Indica 20",
    "Info":"Greenhouse Seed Company",
    "Origins":"Neville’s Haze x Super Silver Haze x Laos",
    "Genetics":"",
    "Flowering":"77 days",
    "Harvest": "early November",
    "others":[
        
    ],
    "Contents":[
        "Arjan’s Haze #3 brings together a father from Laos with a combination of Neville’s Haze and Super Silver Haze. Green House Seed Company recommends this little powerhouse sativa for indoor growers who want the bliss of a haze variety, but don’t have the most spacious of growing areas.",
        "Arjan’s Haze #3 is very flexible during vegetative growth, which facilitates easy breeding. When allowed to grow naturally, it forms the typical pine-tree sativa shape. This plant flourishes outdoors, but is hort enough to be at home in an indoor garden, especially if bending techniques are used for stretchy branching. The branches may need support as the flowers get heavy enough to perform their own, less desirable “bending technique”. Indoor plants do best when grown with two plants every three square feet.",
        "This plant’s height can be further controlled by limiting root development using smaller containers. Plants in 2-gallon containers stay in the 3-4 foot range; plants in 5-gallon containers come closer to 5-6 feet at harvest, and of the roots are allowed to grow without limitations, this plant can climb to 10 feet in height at finish.",
        "This plant reaches optimum ripeness at the end of October or beginning of November. Indoors it takes 11 weeks from forcing. Arjan’s Haze #3 buds can be quite irregular in shape and the hairs are thick and short. Toward maturation, the buds tend to get a very pointy conic shape.",
        "Like many other near-pure sativas, Arjan’s Haze #3 keeps flowering on the main cola while the lower branches are already ripe. This plant has a “very sativa” metabolism; it absorbs feedings well but does not need high EC levels. Green House recommends starting with a low pH (5.5 hydro / 5.7 soil) and slowly increasing to 6.2 at the end of flowering.",
        "Arjan’s Haze #3 has a very woody sativa flavor, a taste of musk and campfires. Underneath is a scent of mint and lemon grass. This haze delivers a potent high with the qualities that most haze fans seek: a soaring clear-headed sensation that is never too heavy on the body. This high creeps up slowly, but once its effects are felt, they stick around for a long while. It is a terriffic strain for creative moods and for the euphoria it can contribute to recreational activities. Anecdotally, it has been promising for chronic pain."
    ]

}