{
    "Name":"Automaria",
    "Type" : "Indica / Ruderalis",
    "Info":"Paradise Seeds",
    "Origins":"Kazakhstan ruderalis x Afghani indica",
    "Genetics":"",
    "Flowering":"55-65 days",
    "Harvest": "",
    "Contents":[
        "Automaria is the latest ruderalis hybrid marijuana strain from Paradise Seeds. This variety combines the desired autoflowering quality from cannabis ruderalis with the more dense, savory, and pleasant cannabinoid balance of a hardy landrace Afghan indica. The ruderalis strain in the Paradise breeding program comes from Kazakhstan, a former republic in the Soviet Union. Kazakhstan is the largest landlocked country in the world, with an area roughly the size of Western Europe, but a sparse population with a density about 5% of Europe. It is a vast, flat steppe that stretches between the oases and deserts of central Asia to ruderalis’ Russian home.",
        "Generally speaking, ruderalis is miniature compared with its indica and sativa siblings. For this reason, many ruderalis-cross plants not only autoflower, but also have a short flowering cycle, maturing quickly into dark and compact plants. Automaria is no exception. This plant maintains a smaller stature than most indicas, and because it has a fas cycle and is free from forcing, it is possible to complete two or three harvests in a spring-to-fall outdoor season.",
        "Indoors, this plant performs equally well in hydro or soil systems. Flowering starts soon after growth is established. If larger plants are desired, transplanting them during the third week will boost the size. Automaria finishes from seed in 8 weeks, with decent yields for such small and fast-flowering plants. While this may not be a top choice for those with ideal conditions, Automaria is a good selection for gardeners who want smaller plants that flower regardless of light exposure and have a rapid cycle. Automaria’s qualities make for a stealthy plant that can succeed in situations where other plants would be ill-suited.",
        "Automaria buds are stoney little nuggets with a pleasant sheen of resin. This strain’s flavor has some Afghan indica spice, but keeps a fragrant floral edge. The Automaria buzz centralizes in the core of the body, and then emanates throughout for a mellow enjoyment."
    ]

}