{
    "Name":"BC Blueberry",
    "Type" : "Indica 80 / Sativa 20",
    "Info":"BC Bud Depot",
    "Origins":"longtime BC Blueberry clone",
    "Genetics":"",
    "Flowering":"55-63 days",
    "Harvest": "mid September",
    "Contents":[
        "BC Bud Depot created BC Blueberry to make a renowned British Columbia clone – the only blueberry plant available in seed form. They crossed the clone plant with an unknown blueberry seed father, resulting in a mostly indica plant that is deliciously fruity sweet with just a hint of fuel.",
        "The BC Blueberry is a moderate brancher, forming the typical triangular shape. She can also be pruned at the transition to flowering, making a nice sea of green plant. She is particular about her conditions, which makes her more appropriate for gardeners with a little experience or a good intuitive sense for adjusting conditions. With the right care, this variety performs admirably in either outdoor or indoor gardens, with an 8-9 week flowering time. Outdoors, BC Blueberry can be grown in temperate regions as long as weather does not turn before the harvesting date, around the middle of September. While this plant can be grown in any medium, soil will bring out her luscious flavors. Yields average 1.5 to 2.5 ounces per plant when grown indoors, or between 4 and 16 ounces in outdoor gardens, depending on growing conditions and vegetative times.",
        "While three-quarters of these plants will be green, one-quarter are a phenotype that features blue tones and pink hairs. Both phenotypes have medium-thick leaves. BC Blueberry is nutrient sensitive and is a dainty eater, so growers should take care to not overfeed these plants. She can also be sensitive to overly wet conditions. At finish plants grow to 3-4 feet, making them good for rooms with space limitations. Outdoors, they will average nearly double their indoor heights.",
        "With TLC, BC Blueberry rewards the hobby grower with compact sweet smelling blueberry buds that are coated with creamy resinous glands. When cured, the buds will turn blue. The effect of BC Blueberry is blissfull. The high creeps into a pleasant and awake state that is very functional. Compared to many varieties, BC Blueberry’s high is relatively short, but comforting and tasty."
    ]

}