{
    "Name":"BC Sweet God",
    "Type" : "Indica 90 / Sativa 10",
    "Info":"BC Bud Depot",
    "Origins":"BC God Bud x BC Sweet Tooth",
    "Genetics":"",
    "Flowering":"40-50 days",
    "Harvest": "early September",
    "Contents":[
        "BC Seet God is a grapefruit and honey flavored indica with a noticeable likeness to her mother, the award-winning God Bud. Unlike mama, BC Sweet God has a fast finish – a short 6-7 weeks indoors. Outdoors, this indica quickness helps BC Sweet God come in before the autumn frost on the coast of British Columbia, as well as in the Pacific Northwest, California, and similar latitudes.",
        "BC Bud Depot prefers soil-based gardens, which bring out Sweet God’s honey, but this plant will also perform well in a hydroponics setup, which offers faded flacors but slightly higher yields and possibly shorter flowering times. BC Sweet God takes a medium nutrient regimen and is resilient and forgiving, which, combined with her general hardiness and pest resistance, makes her a good strain for beginning gardeners.",
        "The odor of this plant is dank while growing, requiring some protective measures. As the plants mature, their swarthy green, indica leaning foliage turns purple. This “sweet” strain is also short, reaching 4 feet maximum indoors. With a little trimming, her minimal branching makes a solid sea of green plant, yielding 2.5 to 3.5 ounces.",
        "Named for both her parents, BC Sweet God mixes the taste undertones of God Bud – a citrus edge, plus some pine muskiness – with Sweet Tooth’s unique taste of honey. The Sweet Tooth genetics also make this plant faster and more robust in all phases of her growth. Her effects may leave tokers exclaiming “Sweet God!” as the day’s cares melt away and this strain’s high creeps into their limbs, bringing a calm and pleasant if slightly lethargic sense of relaxation. BC Sweet God is great for comfortable atmospheres that involve a bit of lounging, socializing, or romancing. She is also good for a nightcap, and for medical marijuana users seeking to alleviate pain from conditions such as arthritis."
    ]

}