{
    "Name":"BC Sweet Tooth",
    "Type" : "Indica 90 / Sativa 10",
    "Info":"BC Bud Depot",
    "Origins":"BC Sweet Tooth x Sweet Tooth #3",
    "Genetics":"",
    "Flowering":"40-50 days",
    "Harvest": "mid September",
    "Contents":[
        "BC Seet Tooth gets her name from her intense sugar on the palate, but just because she is sweet on the tonque does not mean she is dainty on the stone. The BC Sweet Tooth is a candy-coated bomb to the sense, not recommended for daytime functionality, but terrific for inducing sleep, soothing pain or indulging in languorous, mellow relaxation. The combination of medical-grade stone, big yields, and quick finishing time make this variety an excellent choice for impatient growers looking for a cavity-defying sweet indica.",
        "BC Sweet Tooth finishes 6-7 weeks, or by early to mid September in outdoor environments. This rapid schedule brings BC Sweet Tooth in before the frost in coastal British Columbia, or in locations south to the equator. Indoors, this variety can finish even faster, in as little as 40 days. BC Sweet Tooth branches moderately and can ne easily manipulated to conform to either a multi-branch or sea of green gardening style.",
        "A medium feeder that is good for beginners and connoisseurs alike, BC Sweet Tooth is a hardy plant that defends herself well against pests, but can show mold susceptibility if planted too late outdoors or raised in overly moist environments indoors. Her dense, nuggety buds look edible, and smell almost as sweet as they taste. BC Sweet Tooth’s height at finish averages 3-4 feet indoors or 6-8 feet outdoors. Her average yields are 2.5 – 3.5 ounces per plant in an indoor setup, or 4-16 ounces outdoors, depending on the growing region and its conditions.",
        "BC Sweet Tooth’s syrupy buds are good medication for chronic pain, but less optimal for mixed crowds and socializing. This strain delivers a hammer to the head, and can be a day-wrecker if its effects are unanticipated. The high has a lasting effect, and can lead to couch-lock, but if a major body soothing sensation is desired, BC Sweet Tooth is a promising strain to seek out."
    ]

}