{
    "Name":"BF Blue Cheese",
    "Type" : "Indica",
    "Info":"Barney’s Farm",
    "Origins":"Skunk #1 Cheese variant x Blueberry",
    "Genetics":"",
    "Flowering":"60-70 days",
    "Harvest": "late October",
    "Contents":[
        "Barney’s Farm Blue Cheese crosses the popular UK Cheese strain with the perennially popular Blueberry. Cheese is thought to be a distinctive Skunk #1 variant known for its pungent, intense flavors as much as for its immensely enjoyable and easygoing buzz. This strain came up in the UK, where it got a reputation as kind bud, but was only available in clone form. Then Big Buddha backcrossed it in the mid-2000s to create seeds, which opened up breeding possibilities. Here, Cheese is crossed with an indica-dominant Blueberry father, a strain known for its flavors and its purple-blue coloration.",
        "When selectively crossed, these two distinct tasting and widely recognized varieties have resulted in an incredibly fragrant and easy to grow strain. Barney’s Farm Blue Cheese likes to shoot up long and straight, forming a thick main stem. The side branching is significant and forms a strong tree-like frame that can be easily trained to a screen of green. This plant stays short and springy to the touch, with pale orange hairs jutting out of elongated calyxes. Average yields are 1.5-2 ounces (45-60g) per plant.",
        "Barney’s Farm Blue Cheese is a variety with one-of-a-kind taste – it is rich, round, and smooth, with a connoisseur’s spectrum from the sweet and floral to the deep, earthen chocolate baseline. The intense and pungent earthy musk aromas of the Cheese are retained, but are now tempered with sweet incense-like Blueberry notes. The Barney’s Farm Blue Cheese high is very heady. It creeps up then comes on strong and indica, with a full body stone. Many people will enjoy the trajectory of this mentally peaceful and physically relieving buzz. It has a pleasant entry and exit, although as it winds down, some people might find it a bit of a knockout, requiring a short nap to reset before moving on to any other activity."
    ]

}