{
    "Name":"Big Bang",
    "Type" : "Indica 80 / Sativa 20",
    "Info":"Greenhouse Seed Company",
    "Origins":"Skunk / Northern Lights x El Nino",
    "Genetics":"",
    "Flowering":"63 days",
    "Harvest": "early October",
    "Contents":[
        "The Big Bang is a strong, explosive indica, ideal in 5-gallon (20L) containers, as well as for SOG or SCROG systems. This fast, compact plant forms a plump firework of a bush. Big Bang can take a lot of feeding, and will pop out some very smelly buds that can give your air filters a run for their money.",
        "Best results are obtained in a hydroponics system, although Big Bang will also do well in soil. If this plant is allowed to grow large, its strong branching and short internode lengths will require some pruning to allow more light and air to reach the inner and lower branches. Growers should start this variety with amedium-low pH (5.6 hydro / 5.8 soil) and slowly increase to reach 6.5 at the end of flowering. EC levels depend on the system. The maximum EC should be 2.0 in hydro and 1.8 in soil. Adequate flushing should be provided. Plants in 5-gallon containers will reach 4-5 feet at harvest if grown for at least 2 weeks. Plants in smaller containers reach 2-3 feet. With no limit to root development, and ideal conditions, Big Bang can skyrocket to over 7 feet in height.",
        "Big Bang forms small round buds with overlapping clusters of calyxes, and thick short hairs. Although her leaves are bright green, her resin dulls the color with its grayish shade. Her medium-sized leaflets tend to overlap.",
        "Aside from describing her bursting growth, the name Big Bang also describes this strain’s stone, which comes on strong and very smooth, with a semi-narcotic medicinal effect. Like a healing nova within the body, the high expands throughout the sytem to release tension and pain and create a soothing state. The effect is steady and longlasting. Big Bang’s flavor is very intense and sweet, reminiscent of apple, rose and violet candies. Known for her medicinal properties, Big bang is chosen by thousands of medicinal users in Holland, where it is known as “Simm-18”. This strain is goodas a muscle relaxer for multiple sclerosis and helps alleviate chronic pain. Big bang will also be enjoyed recreationally by those seeking a physically relaxing effect. Big Bang won 3rd Prize in the High Times Cannabis Cup, 2000."
    ]

}