{
    "Name":"Blue Cheese",
    "Type" : "Indica 80 / Sativa 20",
    "Info":"Big Buddha Seeds",
    "Origins":"Blueberry clones x Big Buddha Cheese",
    "Genetics":"",
    "Flowering":"63 days",
    "Harvest": "early October",
    "Contents":[
        "Blue Cheese was created by crossing a set of Blueberry males, acquired from several different breeders, with Big Buddha Cheese, the backbone of many of Big Buddha’s breeding projects. The resulting seeds were grown out and a male was selected from 40 different Blueberry x Cheese male contestants, becoming the proud papa of this pungent strain. The selected Blueberry Cheese male was then crossed once again with a Big Buddha Cheese female, making this hybrid a mostly cheese plant with a hint of blueberry.",
        "Blue Cheese has round swirls of compact flowers that develop distinctly purple hues near the finish. The close internodes of this plant make it highly suitable for sea of green growing. Indoor plants in SOG mature in 8-10 weeks. She produces a huge main cola indoors or out, with respectable additions to the yield from the controlled side branching. In the last two weeks, this strain finishes around Halloween.",
        "Blue Cheese’s flavor has a soft fruity kiss of blueberry that fans of the fruit will appreciate, anchored in a strong underlying flavor that is unmistakably Cheese – slightly funky and dank with a woodsy edge. The combined taste is musky and spicy with a sweet cotton candy note and a hint of berries on the exhale. While the yield is not as abundant as some commercial strains selected for their pumped-up buds, growers in search of connoisseur flavors will find the yield to be generous when compared to other varieties in the category.",
        "The biggest pleasure of the Blue Cheese is its high, which comes on smooth on easy, and stays very functional while creating a feeling of great euphoria and an opening into outlook. This high opens the mind by relaxing the body. It’s comforting, balanced vibe that can take a nice long walk, or sit by the fire at home."
    ]

}