{
    "Name":"Bubble Cheese",
    "Info":"Big Buddha Seeds",
    "Type" : "Indica 85 / Sativa 15",
    "Origins":"Bubblegum x Cheese x reversed Hubba Bubba Kush",
    "Genetics":"",
    "Flowering":"55-65 days",
    "Harvest": "mid October",
    "Contents":[
        "Big Buddha has been spreading the gospel of Cheese throughout the UK. In this mission, he finds a flock of Cheeseheads wherever he goes, and comes across many different versions or phenotypes of the Cheese variety, as well as seeing many Cheese crosses. One unique variation came from a friend who is affectionately nicknamed Mr. Cheese. Mr. Cheese provided the mother for what has become the Bubble Cheese. The mother was a cutting that crossed a UK Bubblegum strain with OG Cheese (Exodus). This mother was similar in growth and appearance to the original Cheese but had a much more pronounced bubblegum flavor. Big Buddha created a “father” from a “reversed” Hubba Bubba Kush from Amsterdam. In other words, Hubba Bubba Kush was induced to create pollen on a female plant in order to feminize this strain.",
        "Bubble Cheese is a mostly indica hybrid that grows into a solid Kush-like indica plant – compact and dense, with dark green fat squatty leaves. Its branching is short, thick, and minimal, making it a good performer in a sea of green setup. Bubble Cheese is a moderate to heavy feeder who takes 8-10 weeks to finish. It is recommended for indoor gardens, but if outdoor weather stays above freezing through early November, count yourself among the lucky few who can cultivate a Bubble Cheese garden outdoors.",
        "Expert growers or resourceful beginners with a green thumb will produce some pungent indica with this strain. Indoors, the Bubble Cheese can reach heights of up to 7 feet and produces only moderate yields, averaging 200 grams per plant. The buds are compact nuggets of chewing-gum bud, sticky sweet with resin. The yield can be supplemented by turning Bubble Cheese trimmings into hubbly bubbly hash goodness. The fat glands are there, waiting to be collected, and will not disappoint in quantity or quality.",
        "Mixing bubblegum with cheese may not sound so delicious, until you remember that Cheese doesn’t taste like, well, cheese. Cheese is the old-school spicy-sweet Kush. It possesses an aroma and flavor that when cured correctly brings back wistful memories of the primo tastes of yesteryear. This is Kush with some sugar sprinkled on top; sweet-tooth Kush fans will be happy. The Bubble Cheese high comes on strong. Its sedating buzz has a down-tempo, sleepy bodily sensation. It is not a mental downer, but brings a positivity that allows one to wander pleasantly while listening to music or drift off into dreamland. As a medical marijuana, it is especially appropriate for insomnia or muscle pain."
    ]

}