{
    "Name":"Cataract Kush",
    "Info":"DNA Genetics",
    "Type" : "Indica",
    "Origins":"OG Kush x LA Confidential",
    "Genetics":"",
    "Flowering":"56-63 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "Cataract Kush is a full-on indica, drawing from East-meets-West indica genetics. It is the progeny of a legendary Los Angeles OG Kush clone and DNA Genetics’ LA Confidential strain, bringing a southern Cal indica together with a pure Afghani for a pungent, eye-squinting, high-caliber indica stone.",
        "As plants, indicas are wonderfully versatile. They’re willing to adapt to different growing media, indoor and outdoor environments, and varied growing styles. The Cataract Kush grows rubustly in most settings. It is not a racehorse in the vegetation stage, growing at a slower pace than those accustomed to sativas or hybrids will expect. When pinching or super cropping is used, as DNA recommends, these plants will form little bushes. Depending on how vegetative growth is encouraged, plants roughly double in height after forcing flowering. The leaves are a caricature of the indica stereotype: thick, fat leaflets that are dark green to nearly purple in color. As the buds form on this plant, growers will be sure to notice their unique otherworldly silver sheen. They bypass normal green altogether, as if painted from a different palette. Even once the buds are matured, cured, and in the jar, they still radiate a metallic luster.",
        "This plant is not particularly well suited to hotter climates or conditions, which lead to very tight intermodal spacing and disadvantage in the yield. Instead this indica prefers temperate weather, favoring the cooler over the hotter, as long as it doesn’t freeze or frost. Powdery mildew seems to stay away from the Cataract Kush, and she is not nutrient sensitive. This stuff has a strong, dank, unmistakable smell while growing. The odor only intensifies as this plant flowers. After the proper cure, the smells mature along with the buds for a heady aroma.",
        "Cataract Kush is a connoisseur-grade indica that novices can grow with great results. Even though they can grow this plant easily, they may want to read the warning label first. The Cataract is so named because it brings on the squinty-eyed, Mr. Magoo stone that penetrates deep into the body. This is a heavy stone that creeps up about ten minutes after smoking and keeps building in intensity long after the smoking has ended. Combine that with the creeper effect, and it can cause serious couchlock for uninitiated. Lightweight smokers may have an unpleasant experience if unprepared, but those who are after the big stone indica will be pleased with the hashy, spicy-sweet flavor that brings the rich pungency of Eastern spices. Medical marijuana users will enjoy this strain’s usefulness for pain relief, encouragement of appetite, and assistance with sleep."
    ]

}