{
    "Name":"Cherry Pie",
    "Info":"",
    "Type" : "Indica Dominant",
    "Origins":"Granddaddy Purple x Durban Poison",
    "Genetics":"",
    "Flowering":"56-63 days",
    "Harvest": "late October",
    "Potency":"",
    "Contents":[
        "The genetics of Cherry Pie can be traced to the tasty combination of Grand Daddy Purple mixed with F1 Durban [F1 x Durban Poison]. It’s rare to find the real, sticky Cherry Pie that smells and tastes like thin-mint, but when you do… you will know. With superior genetics like that, it is no surprise this strains gained national recognition as one of the best Bay-Area strains of late.",
        "Some believe Cherry Pie is actually just a revamped version of Cherry Kush (yes it is different) that has been re-named, re-constructed, and re-promoted by Bay-Area growers in the last couple of years. We would disagree, and say that its reputation is well deserved either way. Cherry Pie will make even the most experienced smokers appreciate its full-bodied effects and subtle burnt cherry pie flavor.",
        "These Cherry Pie buds have beautiful bursts of color — mostly dark purple, forest green, and maroon. Maybe I have been spoiled lately, but I’ve come to expect really dense buds that are covered in trichomes every time I buy a batch of Cherry Pie. The structure of the buds are typically Indica looking, like little dense Christmas trees.",
        "The aroma of Cherry Pie is most similar to cherry, wood, and pepper spice. With a distinct cherry taste on the exhale, the smoke is extremely smooth, but will hit you like an iron fist. Completely smothered in resin, the trichome count seems to multiply when breaking open these STICKY buds.",
        "The Cherry Pie strain is known predominantly for its ability to manage stress and anxiety while providing pain relief for patients. This strain is perfect for patients looking for a strong Indica-dominant Hybrid that is both potent and super tasty. The smoke from the Cherry Pie is highly expansive and fast-acting, leaving a lasting impression for all who medicate with it.",
        "Depending on how potent the specific batch, patients may experience a bit of a crash after 2-3 hours from the heavier Indica strains in its’ genetics. Typically though, Cherry Pie is not considered to be that heavy of strain. It’s much more of a tranquil body melt that noticeably starts with the warming of your inner core. Cherry Pie is popular among patients looking for a strain that provides a significant amount of medicine to both the mind and body in the afternoons."
    ]

}