{
    "Name":"Crippled Pit",
    "Info":"Stoney Girl Gardens",
    "Type" : "Indica",
    "Origins":"Crippled Rhino x Pit Bull",
    "Genetics":"",
    "Flowering":"35-42 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "The puzzle of the enigmatically named Crippled Pit, also known as “Crippit”, is solved when you realize that it takes one name from each of its parents. “Crippled” comes from the Crippled Rhino mother strain, a combination of the Cannabis Cup winner, White Rhino, and a Crippler Chocolate Thai from Seattle. The “Pit” comes from the “Pit Bull” father strain, a combination of a p-91 female from Southern California and Stoney Girl’s Sugar Plum strain, the 2003 winner of the Oregon Medical Cannabis Award for Indica.",
        "Bringing these indica-strong winners together in the Crippled Pit has produced a plant that grows like a champ outside as well as indoors. This plant forms a classic umbrella and sports huge leaves and big chunky buds. While indicas are typically short, squat, and bushy plants, the outdoor Crippled Pit plant can easily grow into an 8-foot giant, depending on how the plant is vegetated. Crippit will also gladly grow indoors, giving off a powerful floral smell throughout flowering. Using organics for soil and fertilizer offers great support for maximizing flavor and yields. In climates where the night air turns cool just as fall harvest time approaches, the leaves darken to purple. In more constant climates, the plants will stay green throughout.",
        "Indicas, originally hailing from more temperate regions, are often quicker in their development through the flowering cycle, and Crippit plants are no exception. This variety finishes in about 5 weeks and produces a satisfying yield. When smoked or vaporized, this strain is a strong starter out of the gate and induces a dreamy state of stoniness with a calm, but steady energetic vibration. It has been known to work well for nausea and offers some strong medicinal qualities. Those who try Crippled Pit notice its highly desirable balance of flavors. It hits a Thai top note and a Hawaiian base flavor, with an earthy sweet tone that never gets too saccharine. The big leaves churn out some nice bubble hash, too."
    ]

}