{
    "Name":"Crystalberry",
    "Info":"Seeds of Freedom",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"SensiStar F2 x DJ Short Blueberry",
    "Genetics":"",
    "Flowering":"49-56 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Crystalberry is the star child of a breeding program that selected from crosses using two popular and well loved varieties – the Sensi Star and DJ Short’s Blueberry. Both of Crystalberry’s indica-dominant parents have the distinction of ranging outside the expected indica-driven high. Crystalberry brings together the potent indica stone with a hint of surprisingly heady euphoria usually reserved for more sativa-leaning strains. This variety allows the parental qualities to shine through in its impressively prismatic sheen of resin, producing a more cerebral indica that hash fans will favor.",
        "Thick and sturdy in stature, Crystalberry looks like an indica and grows to a respectable yet compact size. When forced to flower at 12-16 inches, this strain reaches a height of roughly 3 feet (1 meter) at maturity, so even smaller garden spaces can manage multi-branch plants. Multi-branching is a good strategy since Crystalberry is moderately branchy by nature, especially at the bottom of the plant. However, this plant also adapts readily to a sea of green garden with diligent pruning. Crystalberry plants are vigorous and do not share the trait of initial slow growth with their Blueberry father. Beginners can grow this plant with good success.",
        "Outdoors, these plants become broad bushes that will reach 6-8 feet in height. The Crystalberry smell is not too strong when grown undisturbed, but on closer inspection, the buds reveal their wonderful candy-berry hash fragrance. Compared with other varieties, Crystalberry yields are moderate. Outdoors, yields of 10-plus ounces (300g) can be reached when the plants are allowed to establish themselves and grow to full size. Crystalberry buds are dense and dank, producing color hues of purple and blue from the Blueberry genetics. Where this plant may outshine others is in gland production, which follows in papa Sensi Star’s footsteps. Call them crystals, call them berries, either way, the glands are large enough that they can be seen easily without magnification. For those who like to recycle their foliage, Crystalberry will impress with a generous quantity of tasty and potent bubble hash.",
        "The smoke is blueberry tasting with Star’s pungent lemon overtones. Medical marijuana users who rely on the indica to help with pain management but prefer a more head-focused high may find these qualities all wrapped up in the Crystalberry bud."
    ]

}