{
    "Name":"Danky Doodle",
    "Info":"KC Brains",
    "Type" : "Indica 90 / Sativa 10",
    "Origins":"Viking x Big Buds x KC 636",
    "Genetics":"",
    "Flowering":"63-77 days",
    "Harvest": "late October",
    "Contents":[
        "Originally, this indica-ruled variety was referred to as “Double D” because these ladies very simply had gigantic Dolly Parton-size buds. KC decided the name needed to be more distinct from Double Dutch, another popular variety that “Double D” could easily be confused for, but he wanted to stay with the Double D theme. He renamed variety “Danky Doodle” when some visiting American friends suggested it. They said that’s what they called really good weed when they were in school in California.",
        "Few people can say the name with a straight face (especially after they’ve smoked some). Besides sounding goofy, Danky “grows like an imbecile” (as KC says) into the classic Christmas-tree shape with one big cola lump crowning the central branch. Danky’s leaves get super dark and the smell gets deep and pungent as the plant matures. Outdoor plants will grow to impressive heights, flowering in mid-July and ready for harvest in the first weeks of September – a short 7-8 week growing cycle. Indoors, KC recommends 9 plants per square meter (1 plant per square foot). Homegrowers may find that as few as 4-5 plants deliver enough of a yield to keep them in supply.",
        "Danky Doodle’s Viking father was given to KC by a Ukraininan friend who came bearing seeds to Holland by way of Zaire. KC crossed the strong Viking indica with Big Buds, a variety from the tasty and productive Mango gene-line. Then he crossed the Viking / Big buds hybrid with his library strain KC 636 to maintain the genetics of the aging 636 seeds in a live lineage. In short, Danky Doodle turns out to be a “melting pot” of global indica genes for a classic sigh-of-relief body stone. The Mango and KC 636 crossings add increased yield, a nice growth of frost, and a sweet fruit-butter palate."
    ]

}