{
    "Name":"Dark Star",
    "Info":"T.H.Seeds",
    "Type" : "Indica",
    "Origins":"Purple Kush x Mazar-I-Sharif",
    "Genetics":"",
    "Flowering":"65-70 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Strictly speaking, a “dark star” is a term for the celestial object that, due to its immense mass, traps light in its overwhelming gravity, rendering it dark. This is an antiquated term and is now more commonly known as a black hole. But chances are good that the name “Dark Star” did not lead you to think about astronomy. Chances are, if you ever listened to the Grateful Dead, right now you are thinking of the epic song that served as the bedrock upon which hours of improvisational music were built. The song became so associated with the Dead that it was adopted by the Dark Star Orchestra, a unique tribute band who has been meticulously recreating specific Dead shows from the vast catalog of their 30-year tour history. With this indica strain, you may also be recreating a little something special of your own from the touring days.",
        "The Dark Star strain is quintessential old-school stoner weed. An all-indica cross, Dark Star matches the timeless Purple Kush with a true landrace indica from the Khyber Pass in Afghanistan, the domain from which indicas first evolved. This is the weed you hoped you were getting from the skunky smelling hippie on the way into the show. It is a quick onset, long lasting indica buzz ideal for spacing out and letting the music take over.",
        "The Dark Star plant is classic Afghan in structure, growing thick, strong branches at a slow pace, which requires a little patience in vegetative phase and may cause some early anxiety for beginners who expect a more typical indica timetable. This plant is slower than many of its brethren and works best as indoor plant, where it will take 9-10 weeks to reach full ripened bloom. Once flowering, this plant forms a large main cola that is encircled by a crown or budlets. Dark Star flowers, like their cosmic namesake, are super dense and compact. The leaves are wide and so dark that the deep greens take on a blue tinge. When ready to harvest, Dark Star’s color changes quickly, with the spiky bud hairs turning pink-red. This plant’s clones set slowly, but mature plants are easy to manicure.",
        "The Dark Star high is stupefying and narcotic, with spacey, otherworldly qualities. While its aroma is not overpowering, it is interesting with mellow, almost nutty flavors. The onset is fast, and the high will last through a concert or make for a great afternoon. This is not a functional buzz for accomplishing tasks, especially if they involve reading or counting. Dark Star will likely add another dimension to aesthitic or sensory experiences, and acts as an appetite enhances or pain reliever for medical users."
    ]

}