{
    "Name":"Dready Kush",
    "Info":"Humboldt Seed Organisation",
    "Type" : "Indica",
    "Origins":"original Hindu Kush x Hindu Kush",
    "Genetics":"",
    "Flowering":"63-70 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Dready Kush is an all-indica strain with strong roots in cannabis meccas both east and west. The genetics come from the Hindu Kush region, the traditional center of cannabis culture and home to the achetypal cannabis indica. Located in the UK, the Humboldt Seed Organisation has been gathering seed stock to create a library of high quality connoisseur cannabis. This includes the strains used in the Dready Kush cross, which have never been commercially available before. This company utilizes the work of many master European breeders. Dready Kush is the work of Humboldt’s accomplished in-house breeder, Dready Rob, best known for his work in Weed World magazine.",
        "Dready Kush is a short, squat plant with dark waxy green leaves that are jagged and thick. Although it can be bushy as are many indicas, the side branching is not significant, and it prefers to form a main stem. Sea of green systems work well. This plant does best with a medium to high EC, between 1.6 and 2.0. When forced at 12 inches (30cm), the plants are about 16 inches (40cm) at finish, and yield 4-5 ounces per plant on average. To reach maximum potential, run-to-waste systems suit this strain best.",
        "Dready Kush flowers do not make many pistils, but the calyxes become very big near the end of flowering. This strain has strong resistance to bud rot and holds up well in a wide range of situations, although it obviously likes its comfort zone. At finish, this plant is picture-perfect, healthy, and vigorous with well-shaped, compact, and pungent buds. The strong smell translates to an amazing sweet earthy hash-haze flavor.",
        "The Dready Kush buzz is definitely a downer, and takes hold fast. A few hits wipe the short-term memory, making it a good interruption for an unproductive train of thought, but less than ideal for tasks such as reading that require a level of focus to be maintained. When used by the uninitiated or smoked in big doses, this strain can induce paranoia or cause a zone out on the couch. This stone can be dreamy or mind numbing – either way, it tends to create some serious downtime in your day or evening, and encourages sleep. Oils made from Dready Kush are very good for medical applications that call for super-duty indica effects."
    ]

}