{
    "Name":"Easy Rider",
    "Info":"Ceres Seeds",
    "Type" : "Indica / Ruderalis",
    "Origins":"Dutch indica x ruderalis",
    "Genetics":"",
    "Flowering":"45 days",
    "Harvest": "",
    "Contents":[
        "Easy Rider brings genetics from the renegade ruderalis into the mix, offering an autoflowering characteristic that liberates Easy Rider from the tedium of flower forcing. Ruderalis, that wild variant from the Russian tundra, introduces a unique autoflowering characteristic but is otherwise unexceptional. This presents a quest and a challenge for breeders – to select for this desirable attribute while crossing with indica and sativa to bring more ideal qualities to the stash.",
        "Ceres undertook this quest by crossing ruderalis to a Dutch indica-dominant strain from the skunk line well-known for its classical taste and high as well as its versatility in breeding. The result is a short, compact autoflowering plant that can grow successfully in conditions that would otherwise seem impossible: high in the mountains, high up in northern latitudes, or in conditions with lousy lighting or light pollution that would make a 12-hour dark cycle unfeasible. Since it is a cross, there is a chance that one or two plants will be indica-dominant, lacking the ruderalis autoflowering trait and waiting for the light cycle to flower.",
        "The compactness of the Easy Rider plant make it suitable for small spaces and growing the plants close together, giving each about 6 square inches of space. Each plant only yields about a half-ounce, but yields are often still substantial due to the number of plants that can fit in a small garden. Easy Rider looks like a dwarf indica strain, with thick jade-colored leaves and small but solid buds. This is a “bud on a stick” plant, surrounded by a lion’s crest of minimal foliage so that sea of green gardening is a natural choice, and manicuring is a breeze. At finish, this plant is only about 2 feet (60cm), which is a nice stealth quality. This modest plant can hide below a picket fence, banister, or balcony edge. To add to its clandestine qualities, Easy Rider can be planted very early in the year and finish when other varieties are barely halfway through their growth cycle. The short season allows it a good second crop, because it beats the rain in temperate climates and finishes before mold or bugs can settle in. An entire cycle can be completed start to finish in 60 days.",
        "At finish, Easy Rider gets dark green, and the hairs turn a burnished copper-brown. Easy Rider is low on smell, both when growing and even when drying or being handled. The quality of the smell will depend on whether it was grown indoors or out, but its modest smell is a pungent, slightly acrid indica odor. This follows through in the flavor with an earthy depth and sour acerbic bite. The front flavor will cause a slight mouthwatering effect. Easy Rider’s flavor is decent, but not remarkable. The high is a clear headed indica body stone. It does not induce the sleepy eye-droop look, but it is better suited as a sleeping aid than a party favor."
    ]

}