{
    "Name":"First Lady",
    "Info":"Sensi Seed Bank",
    "Type" : "Indica",
    "Origins":"Afghani x Ortega",
    "Genetics":"",
    "Flowering":"45-50 day",
    "Harvest": "early October",
    "Contents":[
        "First Lady is a highly resinous all-indica strain typically grown indoors with lights. She is excellent in a SOG setup, either in her natural shape or when pruned to 2-4 stems. First Lady’s growth is compact and vigorous, with thick sturdy stems, broad leaves, and a strong symmetry that helps the buds soak up plenty of light. Branches tend to push up and out; lower lateral branches should be pruned away if they start to compete for space. This indica enjoys generous nutrient feedings in the second half of flowering – up to the full doze recommended by the manufacturer. First Lady finishes indoors in an average of 45-50 days and outdoors by early October.",
        "The buds are classic Afghani – solid clusters at every bract and internode that form tight round nuggets crowning a collar of fat, dark green leaves. Plants exposed to cool breezes have a tendency to develop purple tones in the calyxes and even more pronounce in the foliage. Calyxes at the apex of terminal buds may start to build on top of each other after the lower part of the plant is mature, leading to multi-peaked tops. The most weight is produced on the unpruned main stem or on topped stems that have been properly vegetated.",
        "The overall shape of the plant is more spruce than conifer; it has a central column of bud as its main feature rather than a more umbrella-like canopy. like many indicas, the First Lady increases 50-100% from its vegetative height during flowering. Its size is manageable in an indoor setup, and can be controlled in a range from a minimal 1.25 feet to a max 4.3 feet when vegged for 4-6 weeks. When allowed to vegetate to a larger size, this plant averages 100 grams per plant indoors.",
        "First Lady is a naturally tough robust plant with a healthy resilience to pests or other inhospitable garden conditions. This robustness combined with the fast finish makes it satisfying for beginners. If irrigated well, she can withstand heat, and stress from fluctuations in temperature from day to night; however, this Afghani native appreciates a dry atmosphere, especially in the later part of flowring. The easiest mistake with this variety might be overwatering or creating an overly humid atmosphere. First Lady’s resilient genetics also make her a good candidate for cloning.",
        "First Lady’s flavor is spicy with some acridity and earthiness, and a gentle honey undertone. The immediate stoney hit segues into a long-lasting body centered buzz. This warm, happy high encourages an affinity and contentment with one’s surroundings and can greatly enhance sensual pleasures, whether they be food, music or physical contact. While functional, this high is better for lounging on a weekend than motivating oneself to get up and out. It is a good appetite stimulator and muscle relaxer and might be good for a camping weekend."
    ]

}