{
    "Name":"G-Bomb",
    "Info":"Big Buddha Seeds",
    "Type" : "Indica",
    "Origins":"G x reversed G clone",
    "Genetics":"",
    "Flowering":"56-70 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "From the underground networks of the UK arose a cutting that became the infamous “G”, also known as G-Force. G’s origins are unknown, but it has been making the rounds since the early 1990s. Rumors or educated guesses as to its composition have included Sensi’s G-13 indica and Flying Dutchmen’s spicy Pot of Gold, but these are unverified. Such guesses are based on the qualities that G shares in common with superstar Dutch indicas – a hardy and vigorous dark indica growth pattern, a unique effervescent quality, and a decidedly spicy hash taste.",
        "When G-Force made it into the hands of Big Buddha, it was considered worthwhile to develop. Big Buddha feminized G by crossing it with a reversed G clone father, resulting in all-female, all-G strain, the G-Bomb. As a hefty indica, G-Bomb is a high yielding plant that forms gigantic colas the size of one’s forearm. This plant likes to form a dense and impressive main central bud, making it a very solid choice for sea of green setups. If sea of green is unappealing, not to worry. Over many years, this strain has been grown in just about every common method from screen of green, big pots, hydro, coco, you name it – and its solid indica diligence leads it to perform admirably across the board. As such, it is a good plant to build up a beginner’s confidence.",
        "G-Bomb loves to be fed well and eats heavily. Indoor plants finish in 8-10 weeks, and outdoor plants can be harvested at the end of October. A little temperature variability is all right as long as the weather stays above freezing. G-Bomb maintains a steady monochromatic green, even when the nights turn cool. These plants also stay pretty short; at maximum outdoor sizes, they are still under the 6-foot mark (around 1.8 meters) at finish. Certainly size matters, but the right kind of size – not plant size, but bud size! This is where G-Bomb cashes in, delivering outdoor yields of up to 900 grams (nearly 2 pounds) per plant.",
        "The G-Bomb aroma has been best described as dank lemony hashish. The citrus bite and an edge of spice will come through in the flavor. G-Bomb is a deep stone, with sedative potency. It is a great addition to the medicine stash of chronic pain sufferers, insomniacs, or others who want the soothing effects of a heavy, slow-release indica."
    ]

}