{
    "Name":"Girl Scout Cookies",
    "Info":"",
    "Type" : "Indica Dominant",
    "Origins":"OG X Cherry Pie (Durban Poison X Granddaddy Purple)",
    "Genetics":"",
    "Flowering":"",
    "Harvest": "",
    "Contents":[
        "For the past few years, people in the cannabis world have been talking a lot about the strain known as Girl Scout Cookies. Cookie crosses have won or placed in several Cannabis Cups. Chances are your local pot merchant, whether he or she is working in a medical dispensary or for a delivery service, has something on the menu called Girl Scout Cookies. But the truth is that the genuine Girl Scout Cookies is quite hard to find. The breeders who created this famous strain — an outfit who call themselves the Cookie Family — do not advertise, and they do not enter Cannabis Cups. Their activities are strictly on a need-to-know basis. So when they contacted us here at HIGH TIMES with an offer to show us one of their rooms and tell us the true story of the GSC, we jumped at the opportunity.",
        "Fast-forward to Market Street in San Francisco sometime last summer. I’m standing outside one of the skuzziest Burger Kings on earth, surrounded by the usual San Francisco street creatures, not really sure who I’m waiting here to meet. I had a phone number for a guy named Jigga, who told me the Cookie Family were going to swing by and pick me up. An SUV soon pulled over, with tinted windows and a bunch of perfect strangers inside.",
        "What was that old line your parents used to tell you when you were a kid? Beware of strangers in cars offering you sweets? But with the promise of sampling some genuine Cookies, I disregarded the warnings of my youth and climbed into the vehicle.",
        "I needn’t have worried, though, because the Cookie Family, represented on that day by Jigga, Flux and Mr. Sherbinski, were a down-to-earth bunch of guys, excited to finally get their story out and claim their rightful title as the originators of this often-bootlegged strain. We were headed out to their production facility, a few hours’ drive from the city. Along the way, I asked them how they all met.",
        "“Me and Flux go back to high school,” Jigga said. “We were into graffiti, the arts. Mr. Sherbinski I met through mutual friends. We’ve been doing breed- ing projects for about five, six years now.”",
        "Like many stoners, the Cookie Family have a sweet tooth, which is why their strains are all named after some sort of dessert — hence such varieties as Sherbert, and, of course, Girl Scout Cookies. Much speculation has been made as to the genetics of the GSC, and while the Family don’t want to give away the whole recipe, the basic deal is this. They had a variety that they referred to as the “F1.” Now, this was a nickname, not an indication of its hybridization status. They could have called it “Freddie,” but they called it the F1. “It’s our secret sauce — I won’t tell you the real name,” said Jigga. “It had this pissy funk and was one of the best strains around aside from the Kush. So the F1 was crossed with Durban Poison and stabilized, and then that strain was crossed with a Kush that itself is something of a legend.",
        "“The Kush we had, the parent, originally was one of those local strains where you couldn’t get any cuts,” Jigga continued. “But we had access to those genetics — something that was brought to Southern California from Jacksonville, FL, from some Deadhead friend. Our friend brought it to San Francisco around 1994. It was known as ‘Kush’ until Snoop and B-Real started to name it ‘OG Kush’ — one of the dankest Kushes of all time.” A few hours outside of San Francisco, we arrived at an idyllic country farm complete with cows and goats — the home of the Cookie Family’s production facility. The grow consisted of two rooms in different stages. The first growroom was in the fourth week of vegetation and was filled mostly with GSC and a few Kushes. They grow in 3’ x 6’ Geopots, which are basically fabric beds that allow the roots to mingle, filled with a soilless coco blend, Botanicare Moisture Mix, augmented with organic fertilizers, their own brew of nutrient tea and various microbials. The plants grow big and are encouraged to bush out. The Cookie Family fit nine plants under each 1,000-watt high-pressure sodium (HPS) light, with 18 plants in each Geopot. This far inland, their biggest issue is the heat, so the Family built a fully enclosed air-conditioning system and have eight filtered intake fans.",
        "I asked Jigga if the GSC required any- thing special when grown. He likes to think of her as “a model,” he replied: “She grows tall and slender and requires a little more attention. What’s unique is that she has a higher threshold for nutrients, is able to handle a higher dosage of ppms, depending on what you’re using. We found out by trial and error, looking at the tips of the plants, learning where she will burn and when you have to back it off. The odor is really strong, so sometimes the charcoal filter won’t really work — you can have a funk that’s so loud, it will go through a brand-new filter, so you have to double the filter or be prepared for that. It’s a challenge in a smaller environment.",
        "“Also, a slow, natural cure is very important. We like to hack the plant whole and just remove a few of the fan leaves. We prefer the old-school tobacco cure, slow and easy, a two-week dry. I should mention too that Cookies is not a high-yielding strain. Bottom line, if you’re looking to pull weight, this isn’t the one for you.”",
        "The next growroom was basically a mirror of the first, but farther along.",
        "“These girls are five weeks from harvest, perfect for pollination — right when these pistils start to show their hairs,” Jigga explained. “This is where we introduce some compost teas and microbials to keep it at optimum health. And we like to brew our own. We try for the most organic approach for the patients and users who finally get to use this as medicine.”",
        "Since breeding is the Cookie Family’s specialty, they had a treat in store for me: They wanted me to pollinate a plant and name the genetics after me. I insisted that a strain named “the Simunek” would be a commercial disaster for them, so they started toying with one of their trademark dessert names, something that might reflect my East Coast roots. After some thought, we settled on the name “Gelato.” For pollination, they fit a fibrous polyurethane bag over a single bud on a chosen plant, then make a slit in the top, pour in the male pollen and seal it back up. This way, if they so desire, they can cross a single plant with several different males.",
        "I asked them about the varieties out there that are being sold under the Girl Scout Cookies moniker — some of which have even won Cannabis Cups. Since the Family haven’t given away their genetics, how do they account for it?",
        "“We call these Fortune Cookies,” Mr. Sherbinsky said.",
        "“I’ll tell you what a Fortune Cookie is,” Flux put in. “It’s when people buy a bag of Girl Scout Cookies, open up a bud, and there’s a seed inside it. It’s an inside joke.”",
        "The Cookie Family also have several new projects on the horizon. They are currently building a huge genetic library, though they’re not looking to put it on the market anytime soon. What you will see in the near future is something they refer to as “Pollen Nation,” which will be a program to market the male pollen of the GSC. Rather than selling seeds, they want the Cookies to be a more intimate experience for growers. Jigga explained that, by making the pollen available, they allow cultivators to “find and unlock the different healing potentials that this plant has to offer on a personal level, whether it be its proven medicinal purposes or something that just helps your creativity.”",
        "And then there’s the breeding proj- ect they have going with DNA Genetics, winners of numerous Cannabis Cups and one of the most successful seed banks around today. The Cookie Family and DNA are working to cross a couple of classic DNA strains with the GSC and bring them to the market. Tangerine Cookies? Kosher Cookies? When these two super-breeders finish their work, people will finally be able to purchase some Family-endorsed GSC hybrids.",
        "“We only work with select people,” Mr. Sherbinsky explained. “We could be out there pushing it, but that’s not what we do. When we say ‘the Cookie Family,’ we have a large network of friends, and we work collectively to make this happen. We’re educating ourselves how to grow the best plants using organics, which is basically earth and nature. We are spiritual people, and we have a moral code we live by — and this plant is a huge part of what we believe in and what we stand for.”"
    ]

}