{
    "Name":"Granddaddy Purple",
    "Info":"Apothecary",
    "Type" : "Indica",
    "Origins":"Northern California",
    "Genetics":"",
    "Flowering":"60 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "Apothecary specializes in creating medical strains. They have been growing and refining this all-indica variety for five years. Her ancestors have grown in the hills of Northern California for over two decades, where her phenotypes have been known by many different names including Grape Ape, Purple Erkel, and Grandaddy Grape Ape.",
        "As an indoor crop, Granddaddy Purple is equally happy in hydro or soil. With a pure indica heritage, this plant is predisposed to a short bushy stature. Granddaddy branches extensively, making her less than ideal for SOG style grows, but she can be trained to make an awesome super crop garden. When left to her natural tendencies, this strain will make a nice big shrub that reaches about 3 feet indoors or up to 8 feet outdoors. She is a hardy grower with tight internodes and dense dark green to purple leaves.",
        "Granddaddy Purple is easy to work with throughout her growth cycle. She likes a cool temperature, between 70-80 F, and can be very forgiving so long as she is adequately watered. Due to her high resin output and dense structure, this plant can be alluring to mites.",
        "Granddaddy Purple finishes her flowering cycle in 8-9 weeks. The buds are dense green nuggets that gain royal purple hues as they mature. Depending on the size she is allowed to reach, Granddaddy Purple can yield between 0.5 and 3.5 ounces apiece. outdoor plants will really deliver, with potential yields between 8 ounces and 5 pounds.",
        "There is a potent, undeniable grape tinge to this plant’ aroma, and a sweet grape taste that lingers subtly on the tongue. Granddaddy Purple’s effects are enduring, with a smooth even feeling throughout. For an indica, her buzz is surprisingly alert and energetic rather than sedating. This is a good smoke for walking in the high meadows and swimming in the lake afterwards. Medicinally, this variety has given relief to cancer / chemotherapy patients. Granddaddy Purple has taken first prize in no less than four pot competitions: The Inglewood Medical Cannabis Cup in 2004, and the Green Cup in 2004, 2005, and 2006."
    ]

}