{
    "Name":"Hashberry",
    "Info":"Mandala Seeds",
    "Type" : "mostly Indica",
    "Origins":"California Indica x Kashmir strain",
    "Genetics":"",
    "Flowering":"60-65 days",
    "Harvest": "late September",
    "Contents":[
        "Hashberry is the unique result of a rigorous selection from desirable parents, one of which contains landrace genetics from Kashmir, North India – home to generations of great hashish. This mostly indica strain is suitable for indoor and outdoor climates, performing best out in nature in the latitudes between 45 degrees North and South, and in climates that have a dry autumn season. Indoors, this variety does well in all grow systems, including sea of green.",
        "Mandala has paid special attention to the preservation of this hybrid’s vigor. Outdoors, Hashberry is a hardy strain with a thick stem structure to carry her heavy load of buds. her average flowering time is 8.5 to 9.5 weeks. Outdoor plants in warmer climates will finish at the end of September, while temperate areas require an additional few weeks. Flowering times outdoors can be shortened by as much as two weeks if well established clones are transplanted around summer solstice. In organic indoor grows, you can almost do without feeding; an adequate pot size and quality potting soil is all you need for optimal results",
        "Mandala recommends allowing seedlings to reach 8-10 inches (20-25 cm) and then forcing flowering. Using this method, growers can expect an average yield of 450-500 grmas per square meter under 400 watts per square meter. This is an easy plant to grow and show good heat resistance. its medium-sized stature makes Hashberry a good selection when space is at a premium. There are two distinct phenotypes: one is shorter and develops branches that reach up to to the middle of the plant; the other is slightly taller with almost no branching. Both are perfect for close planting, but the branchy type should be given a bit of extra space for better light dispersal.",
        "Hashberry carries an extremely heavy main cola that dominates the plant structure and contributes to her above average yields. The cola offers a delicious aroma, and an old school high and taste. Many old-timers have reported that smoking this strain reminds them of the finest Columbian grass of the 1970s, an effect Mandala refers to as “vintage deja-vu”. this strain is easy to trim and the dried buds have great “bag appeal”.",
        "Young flowering plants develop a fruity-floral aroma that smells like blueberry or black current jam. Some plants have a more spicy note mixed in with the fruity-floral bouquet. As flowering and resin production progresses, a hashy aroma also sets in. Other plants have a minty-peppery taste to them that is equally pleasant.",
        "As the name suggets, Hashberry is a great variety for the hashish fan. The high starts out very clear and builds slowly into a clasic chill-out vibe with a relaxing, and balanced head-bidy effect. Toward the end, a more body-oriented phase sets in that nevertheless leaves you able to be social and active. Hashberry is perfect when used to relax and unwind in the evening, or to alleviate stress and pain."
    ]

}