{
    "Name":"Herijuana",
    "Info":"Sannie’s Seeds",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"Motarebel x Herijuana IBL",
    "Genetics":"",
    "Flowering":"49-56 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Sannie’s Herijuana was developed in 2007 to maintain the Motarebel Herijuana genetics. The breeder Motarebel was well-known for developing medical quality strains, and Herijuana is no exception. This intense heavyweight indica strain has inbred parental lines of Motarebel Herijuana originating in the US from a male Killer New Haven Strain and female Petrolia Headstash.",
        "The Herijuana plants starts low and branchy and develops to an open-structure bush with vertically reaching branches and a leaf structure that reveals the sativa side of the strain. Herijuana buds, however, are true indica in form, growing many individual buds that are dense as golf balls. Growers will find this plant an agreeable partner in the garden. She forgives brief extreme temperatures and shows resilience to other minor variations in conditions. Sannie’s recommends organic fertilizers and a screen of green setup for maximum yields, although this plant can also be tamed to a sea of green setup with 16 plants per square meter.",
        "Sannie’s Herijuana has a alrger node ditance than the typical indica, making manicuring less intense. When flowered at about 2.5 feet (30 cm) it increases in size by about 1.5 times to reach a little over 4 feet (1.2 meters) at finish. The individual buds become very compact and resin covered, challenging some grinders with their density.",
        "Growers will be eager to witness the formation of Herijuana’s trichome-dense, ball-shaped buds. The smell is hashy and incense-like, and the taste is smooth with light sandalwood and dark coffee essences. This variety has become well-known among medical users for its strong and effective indica action. When smoked, the Herijuana reveals itself quickly in an intense, deeply physical and long lasting sedative stone. This is not a buzz for a lighthearted social evening or a neophyte smoker. For those seeking muscle relaxation or relief for insomnia, Herijuana holds much promise."
    ]

}