{
    "Name":"Iranian Autoflower",
    "Info":"Greenthumb Seeds",
    "Type" : "Indica",
    "Origins":"Iranian x NA S1",
    "Genetics":"",
    "Flowering":"40-50 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Iran is also widely known as Persia. This home to one of the world’s oldest known continuous major civilizations has a long history with cannabis, and in particular with hashish, including tales that date back a thousand years. The country if Iran is roughly the size of the UK, or slightly bigger than the state of Alaska. It is southeast of Kazakhstan and Russia, two countries believed to be the birthplace of autoflowering strains. Iran has coastline along the Caspian Sea in the north and the Persian Gulf in the south, but is probably more known for being sandwiched between Iraq and Afghanistan. Much like these neighbors, Iran has much mountainous terrain, which turns to desert as one moves south and east.",
        "Dr. greenthumb’s Iranian Autoflower strain is an all-indica strain with parents from the rugged terrain of Iran. It was developed for outdoor use in temperature climates. This lush green plant will grow anywhere, and finishes in just 90 days from start to finish. The Iranian Autoflower is compact, growing between 3-4 feet in most gardens, although it can reach heights of 5 feet at maximum. This variety tends to keep branching minimal and focus most of its energy on developing a single dominant cola.",
        "This plant can finish in 3 months from seed to harvest, spending about half of that time in flowering. Since this is an autoflowering strain, the plants shift into flower development without strict light cycles, making it an easy plant to grow outdoors. Multiple harvests are possible from spring thaw to the first freeze of late autumn, and the lack of light requirements allows harvesting to occur in months during growing. When combined with potential off season harvesting and compact size, they offer an impressive stealthiness for outdoor growers.",
        "Iranian Autoflower buds form tight dense nuggets that take on golden hues as they cure. Average per-plant yields are 4-8 ounces. Iranian Autoflower reflects the long hashish tradition of its native nation region. In a side-by-side comparison, testers equated this all-indica strain’s potency to White Widow and OG Kush. The deep earthy tones bring out flavors reminiscent of hashish, and the smoke has strong narcotic and pain-relieving qualities that lead card carrying med-users to ask for it by name."
    ]

}