{
    "Name":"K-Train",
    "Info":"Green House Seed Company",
    "Type" : "mostly Indica",
    "Origins":"Trainwreck x OG Kush",
    "Genetics":"",
    "Flowering":"60-65 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "K-Train takes its K from the Kush, as in the Hindu Kush mountain regions of marijuana’s homeland, the origin of its OG Kush father. The OG Kush side of the family is indica-dominant, drawing on a long line of Afghani genetics. K-Train’s “Train” comes from the notorious Trainwreck, a beloved California native originating in one of America’s marijuana hotspots – Humboldt County. Trainwreck stood out even in this land of kind bud because of its soaring, highly creative yet smooth and lucid high. K-Train combines these two highly appreciated strains to create a K-O strain for left-brain activities. This is a fast, strong, physical buzz with a creative edge.",
        "K-Train performs adequately in a sea of green, but screen of green setups work better. These indica-dominant plants have short internodes yet rapid growth in hydro or soil, with thick dense colas. Green House gardeners prefer this plant in a hydro setup with synthetic fertilizers and an EC up to 2.2. After flower forcing, this plant finishes in 9 weeks, or it can be successfully grown outdoors, where it can be harvested at the end of September in southern Europe.",
        "K-Train is a s :stoned to the bone” strain with a rapid onset and deep body sensation, making it suitable for passive activities that are stimulating to the senses, such as watching surreal movies or listening to great music. The Kush’s dark, nutty, and earthy licorice tones hold the bass line with a fruity, berry-like melody formed from the Trainwreck influences. The aroma has a spicy sweet roast of pistachios or almonds, but the spice tends to fade to sweet in the afterburned flavor.",
        "Medical uses for this strain range from treatment of depression and stress to conditions that benefit from strong body effect. Take a ride on the K-Train and find yourself transported to a more relaxing state of mind without ever leaving the comforts of home."
    ]

}