{
    "Name":"Kandahar",
    "Info":"Ministry of Cannabis",
    "Type" : "Indica",
    "Origins":"Afghani x Afghani Skunk",
    "Genetics":"",
    "Flowering":"56-63 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Kandahar is named after the southernmost region of Afghanistan, an arid terrain that sweeps east from the base of the Hindu Kush. In current times, this area is known for war and turmoil, but the city of Kandahar has an ancient history with man and marijuana. Kandahar is one of the oldest known human settlements and served as a bustling hub of trade, linking crucial routes through south and central Asia. The Kandahar marketplace was once filled with an abundance of aromas and textures from tobacco, silk, wool, and fresh and dried fruits, and also quite possibly hashish. This area is believed to be the birthplace of cannabis indica.",
        "The Kandahar namesake strain is an indica hybrid with a pure Afghani mother and a father Afghani that has been crossed with a California Skunk to balance is characteristics. The Kandahar plant is a trademark indica – a squat, branchy plant with compact, tightly formed calyxes that evolve into pale green, resinous cones. The branches do not climb and stretch like its sativa cousin, but instead stay reserved and close, creating a narrow Christmas-tree growth profile.",
        "Although optimal as a multi-branch plant, Kandahar can be tames to a sea of green by a grower determined to use this technique. The leaflets are a pale green that one might expect from such a heavy indica, but they are thick with many leaflets. As Kandahar reaches maturity, the leaves may start to turn a bright yellow or may purple if the weather turns cold. Unlike some indicas, this plant can really soak up the PK, and she still takes 8-9 weeks to reach optimal ripening. Kandahar has good resistance to mold and fares well if the nights get a little nippy. Outside gardeners who plant in late July can harvest in the beginning of October. On average, indoor yields will range around 1 pound per square meter, or 14 ounces per plant outside.",
        "If you have just sniffed plants with strong candy-sweet aromas, then Kandahar will not seem sweet by comparison. However, on its own, this variety captures the complexity of a street bazaar with sour-sweet fragrances that combine ripe fruit and dry forest muskiness. Once cured, the buds are nice tight nuggets with a woodsy and nutty taste, and a hint of sandalwood. As they are burned, they get the pleasantly warm fragrance of toasted nuts. The high settles deep in the body with potential for couchlock intensity. Down tempo music, television, or other undemanding yet sensory activities will pair well with Kandahar’s sedating qualities. It’s all good – sit back, soak it in, and enjoy the satisfying sense of relaxation."
    ]

}