{
    "Name":"kc-36",
    "Info":"KC Brains",
    "Type" : "Indica 85 / Sativa 15",
    "Origins":"White Widow x KC 606",
    "Genetics":"",
    "Flowering":"56-70 days",
    "Harvest": "late September",
    "Potency":"",
    "Contents":[
        "KC-36 is a mostly indica strain that is a great choice for outdoor growers in temperate regions. This strain was bred specifically to thrive at high lateitudes. It flourishes indoors and out, and can be grown in Holland or at equivalent distances from the equator with a finishing time at the end of September. In fact, it will flower too early if attempted outdoors in more southerly latitudes.",
        "As an indoor plant, KC-36 finishes in eight to ten weeks. She stays small and compact, making her great for indoor growers with space limitations. Outdoors, KC-36 will reach moderate heights, around 5-6 feet. KC Brains recommends growing in hydro indoors, but suggests that outdoor grows in soil should consider organics in order to allow the buds to bring their best qualities forward in the harvest.",
        "KC-36 shows her strong indica influence in her wide, webbed, dark green leaves; in her bushy stature, and eventually, in her dense and compact buds, profuse with crystal formations like the signature frost of her White Widow mother. She is a multi-brancher, with tight buds forming in many locations. She tends to have an asymetrical profile because some of her branches stick out.",
        "This vigorous northern plant can adjust to variable weather conditions and withstands both cold weather and moisture in moderate doses. She has shown some mold resistance when faced with wet conditions. KC-36 is also quite smelly, which may be a disadvantage if countermeasures are not in place or the outdoor location is not remote enough from curious neighbors.",
        "KC-36 has a fast onset, powerful body high. The inhale is expansive, with a floral spice reminiscent of White Widow. Its smoke is likely to cause little coughing spells, followed by smiles and body relaxation. This is more of a cozy afternoon smoke than a party pot. KC recommends it for a lazy day of hanging with friends, for an enhanced sense of peace when out in nature, or as a nice enhancement for a good movie or CD. Anecdotally, it’s good medicine for migraines and hyperactivity."
    ]

}