{
    "Name":"King’s Kush",
    "Info":"Green House Seed Co.",
    "Type" : "mostly Indica",
    "Origins":"OG Kush x Grape Ape",
    "Genetics":"",
    "Flowering":"",
    "Harvest": "",
    "Potency":"THC 19%",
    "Contents":[
        "Green House Seed Company since 1985 has bloomed into one of the most successful seed companies to date. They have also become probably one of the most (of not the most) recognizable Dutch Seed Companies and Coffee Shops around. This is in part because of their top notch genetics. King’s Kush is one of their gems, and is famous for its productivity and powerful, fiery smell. It is a hybrid of a clone of the strain that put Southern California on the map OG Kush and a Grape Ape original clone. This strain seems to take on more of the Kush traits, which is fantastic for the person who can get their hands on some of these seeds. The OG Kush has become part of pot legend and lore, and has developed into a preferred strain of breeders globally.",
        "When transplanting your King’s Kush seedlings, you need to make sure that your light source is not too elevated from the middle as your sprouts will extend to get to the light and could give way under their own weight previous to you ever getting started. If you can manage to avoid this, then this medium sized Indica strain will grow to have elongated branches protruding both outwards and upwards. It will have profound green leaves and colored slightly with purple, because of the Grape Ape genetics. The same as with all purple strains, colder temperatures allow for the most intense colorings to come out. So, if you are growing outdoors in colder weather or should you decide to bring down the temperature of your grow room, you will be pleased when you notice the stunning display of violet and blues.",
        "Although these plants appear somewhat docile in their stature, do not be scared to nourish them rather aggressively. Extreme feeding will produce enhanced flowering in this strain. If you are using a Hydro setup make sure that you flush it frequently to avoid excess build up in your system. This buildup can have a harmful impact on growth. The common flowering time for King’s Kush is about nine weeks. At the time of flowering the bluish purple veins on the plant will be going wild, which will give you a grow room that looks like something out of a movie. If you are growing outside you are probably going to want to harvest at the end of October.",
        "King’s Kush is absolutely majestic in its grape scent, which is powerful, pungent, and tangy. There seems be tons of sweet weeds around so it is a nice change that this strain comes across as Sweet and Sour. Besides just the grape smell, there are also subtle hints of lavender. This smoke gives you an unbelievably hard hitting munchies-inducing high. Once this strain gives you are appetite back, you will fall into an extremely sluggish, dreamy and slightly euphoric condition that may be exactly what you are looking for."
    ]

}