{
    "Name":"Kish",
    "Info":"Cash Crop Ken",
    "Type" : "mostly Indica",
    "Origins":"Shishkaberry x Shishakberry",
    "Genetics":"",
    "Flowering":"42-45 days",
    "Harvest": "early September",
    "Potency":"",
    "Contents":[
        "In the language of pot breeding, “berry” strains are usually dark, strong indicas with sweet flavors. Kish is a cross of two Shishkaberries, which are themselves a Blueberry / Stinky Afghan cross, noted for their cherry-flavored smoke. Thus Kish is very, very “berry” – tasty, potent, and easy to grow; a great candidate for the beginning cultivator who wants a classic couch-lock high.",
        "This indica-dominant plant grows short and bushy, like a miniature Christmas tree with broad leaves and one primary cola. If the top is cropped, Kish will umbrella. However, Kish likes her main cola, and if side branches are trimmed, this plant will happily invest its energy in the single bud, making it great for sea of green systems.",
        "A quick finisher, Kish can be ready for harvest in as few as 6 weeks of flowering depending on the intensity of sun or lights that shine on your garden. In fact, allowing it to ripen for 7 weeks or more results in a reduction of the quality of the harvest. Kish does better under Sunmasters than HPS lights. When budded in big pots, this strain will usually reach 3-4 feet in height at finish. Yields have been reported at around 56g per plant. It can also grow outdoors with good results. It will finish by the end of September.",
        "Along with the fast finish, Kish is likely to be successful for the starting garden because it is a versatile plant, proving hardy in many grow environments, and showing great stamina when faced with stresses. The harvest-ready buds are deserving of the name “nugget”. They are round, chunky, and surprisingly hard. The buds shrink very little when drying, meaning that each cola really weighs in. Kish buds have a sharp fruity flavor, leaning towards cherry or raspberry. Kish is strong in buzz as well as taste. Two or three tokes will knock even a seasoned smoker between the eyes. Although not too sleepy, this buzz tends to be low tempo, with good duration, and is probably best suited for armchair olympics, with snacks near at hand. This variety is a favorite among multiple sclerosis patients."
    ]

}