{
    "Name":"LA Confidential",
    "Info":"DNA Genetics",
    "Type" : "Indica",
    "Origins":"California indica x Afghan indica",
    "Genetics":"",
    "Flowering":"46-56 days",
    "Harvest": "early October",
    "Potency":"",
    "Contents":[
        "LA Confidential is a commercial seed strain that captures the genetics of OG Kush. An Afghan strain grown from clones, OG Kush first became popular in the Los Angeles market in the 1990s, and then became world famous as California rappers like Snoop Dogg and Cypress Hill namechecked it in their songs. OG Kush offered a has-like experience from reefer: a resinous smoke, deep and spicy-sweet like nutmeg, that drew the smoker into a lush, slightly trippy dreamland. While “Authentic OG Kush” may be hard to find if you’re not a rap star, DNA’s LA Confidential brings the secrets of this celebrity smoke to the market.",
        "LA Confidential is an indoor-adapted plant that can also be grown outdoors or in a greenhouse. This strain is resistant to mildew, and on the whole is easy for even a novice to grow. She likes any medium – hydro, coco beds, soil, or NFT systems. If forced into flowering at 3-4 feet of growth, LA Confidential stays petite, gaining only a foot in the rest of her cycle, making her a good strain for gardeners with limited space. DNA themselves prefer bigger plants, vegetated for 3-4 weeks, for a lower overall plant count. Like many eco-conscious growers, DNA recommends organic nutrients.",
        "As she moves through flowering, LA Confidential forms popcorn-like buds that are very dense, and so dark green that they almost appear black by harvest time. The flowering time is speedy, finishing in 7-8 weeks indoors, or by late September to early October when grown outside. These are the sweet “rocks” of resinous bud associated with her OG Kush ancestors. LA Confidential is not the biggest yielding strain, with average yields between 300-500 grams per square meter from “petite” plants in close quarters; yields from larger or outdoor plants may be correspondingly greater.",
        "LA Confidential delivers a heavy “Kush” high: tasty, languorous, and a little psychedelic. Experienced smokers will find it relaxing but not sleepy, although probably too relaxing if there are complex tasks to be done. This is a chill-out smoke. What this indica strain lacks in monstrous yields it makes up for in high, taste, and smell. Many weed experts agree – LA Confidential has won second (2005) and third (2004) place for indica at the High Times Cannabis Cup, and first place for indica in the international Cannagraphics Cup (2005)."
    ]

}