{
    "Name":"Mr. Nice",
    "Info":"Sensi Seed Bank",
    "Type" : "Indica",
    "Origins":"G-13 x Hash Plant",
    "Genetics":"",
    "Flowering":"60 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Mr. Nice was named in honor of Howard Marks, the Welsh cannabis campaigner, author, and one-time hashish entrepreneur. Marks became a folk legend after writing his bestselling 2002 autobiography Mr. Nice, which tells the story of his life as an international marijuana smuggler during the 1980s leading up to his DEA bust. In 2010, his story was made into a movie out of the UK, which was also titled Mr. Nice. Marks continues to write about marijuana and to advocate for its legalization.",
        "His namesake strain also starts with weed folklore. The Mr. Nice mother is a G-13. G-13 is the rumored US government pot from their Mississippi facility. An unknown technician rescued a cutting from this facility, after which it was brought to Holland. This 100% indica strain is an Afghani genotype. The Mr. Nice father is Sensi Seed Bank’s Hash Plant, a cross that is 75% Hash Plant and 25% Northern Lights.",
        "In Mr. Nice, these two power-hitters combine to deliver a vigorous and iconic indica. Deep jade and short in stature, these plants support havy bud production with outstanding resin levels on sturdy thick stems. Much like Mr. Nice himself, the G-13 x HP seed strain was big in the 1980s, when it earned quite a reputation after its introduction. However, it was only released as a limited edition at the time and soon became a rare find. In 1999, Sensi brought this legendary cross back to honor a living legend.",
        "Mr. Nice forms a very large central cola, and its restrained growing pattern allows it to grow admirably in a sea of green setup without being overly crowded. Growers looking for a star indica will enjoy the efficiency and vigor of these tough and capable plants in the garden. Yields are admirable, even when plants are kept small.",
        "Indica connoisseurs will savor this variety’s mouth-watering “double-Afghani” bouquet. The dense bud clusters ripen into a rich, spicy-sweet tang of raw resin glands, blended with dark, earthy undertones. When sampling the stickiest nuggets, the taste can convince people that they’re smoking a mix of hashish and ganja. The potency of the stone may test people’s limits with its knock-down Afghani body rush."
    ]

}
