{
    "Name":"Northern Lights",
    "Info":"Sensi Seeds",
    "Type" : "Indica",
    "Origins":"NL5 x NL2",
    "Genetics":"",
    "Flowering":"45-50 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "The Northern Lights (NL) is one of the most potent and famous indica strains. Even though there are a lot of copies circulating around with variations on the name, there are only 3 pure types from the original development of Northern Lights, which Sensi was lucky to acquire.",
        "Historically, the NL 1, a longer, more stretchy type with a fresh scent and good bud formulation, was the basis of the NL cross that was sold as Sensi’s Northern Lights. Currently, the NL 5 has taken over the most important role in the cross. Because NL 5 adds potency and reduces flowering time, but is not dominant in taste and smell, it also plays a starring role in the overall breeding plan at the Cannabis Castle. It has functioned as a test case for many crosses. The f1 generation is very predictable, giving uniform results and passing uniformly onto its hybrids it parents. The NL 2 contributes to the overall vigor of the plant and strength of the high, also lending its spider mite resistance to the cross.",
        "Highly adapted to indoor growing, Northern Lights is a satisfying yielder that can finish in just over 6 weeks. The best results are obtained from hydro culture gardens. Small sea of green plants or bigger indoor plants will both do well, but remember that yield is directly related to the amount of light and space.",
        "A petite plant averaging between 4 and 5 feet, NL has dense, resin-rich flowers and wide-fingered indica leaves. The aroma is pungently sweet and the taste is a flavorful mixture of sweet and spicy. The high is a potent physical experience that feels comfortably lazy and relaxing.",
        "Northern Lights’ fame extends to the harvest festivals where it claimed the overall High Times Cannabis Cup win in 1990, and the Cup’s award for the pure Indica category in 1988-89."
    ]
}
