{
    "Name":"Nuken",
    "Info":"Cash Crop Ken",
    "Type" : "mostly Indica",
    "Origins":"Kish x God Bud",
    "Genetics":"",
    "Flowering":"49-56 days",
    "Harvest": "early October",
    "Potency":"",
    "Contents":[
        "Nuken is a Canadian native, a cross of a Kish father (see Kish) and God Bud mother. God Bud is a beloved purple skunk strain that has gathered a reputation up North for easy growing and a deep stone. It came to Cash Crop Ken from a veteran grwoer of 30 years. Kish is double Shishkaberry cross that is indica dominant, so she finishes quickly and produces a satisfying harvest of chunky nugs. She has emerged as a popular Afghan in recent years, a solid producer of resinous buds with strong effects. Coming from these parents, Nuken promises to be a real warhead of hassle-free indica meltdown.",
        "Nuken is easier to grow and reaches larger sizes than her parents. her height more than doubles during the flowering cycle, and can easily reach 5 feet by harvest. Nuken can be pruned to make a good sea of green plant and is also suitable as a multi-branch plant. Her branches are thick, lessening the need for support, and her seven-leaflet foliage is a medium green. Nuken is proven indoors, where she grows comfortably and ripens in a short 7-8 weeks. Although she has not yet been tested outdoors, her harvests can be expected in late September or early October. As with many Afghani strains, this plant should be kept away from moisture.",
        "Nuken’s buds are rounded and tight, although not quite as rock hard as her Kish parent. The buds are not especially smelly when growing, yet Nuken’s finished smoke fills the mouth with an almost marshmallow type sweetness and a strong skunky green overtone. Her buzz is long lasting and quite strong, relaxing without being especially sleepy. It can be a good day or evening smoke, but probably not one for a work break. Nuken’s indica body radiation is best for chatting in your own imagination.",

    ]

}
