{
    "Name":"OG Kush",
    "Info":"DNA Genetics",
    "Type" : "Indica",
    "Origins":"Los Angeles Kush x SFV strain",
    "Genetics":"",
    "Flowering":"57-60 days",
    "Harvest": "mid September",
    "Potency":"",
    "Contents":[
        "The “Original Gangster” OG Kush comes from the San Fernando Valley in Los Angeles and is considered to be the strain that put Southern California buds on par with the flowers coming from up North. Developed over three generations and years of stabilizing as well as developing the perfect fertilizer / food for this particular strain, resulted in a phenomenal kush, said to be the strongest indica today.",
        "The OG Kush was formally a clone only strain. She stretches in veg but seems to fill herself out in flower. She has smaller nugs that you can get a good yield from if you supercrop her while she’s growing. OG Kush prefers to be grown indoors in a hydroponic setup.",
        "OG Kush, when properly grown, has the highest THC content of all kushes and is sometimes so strong, it “makes your teeth hurt” after you smoke a bowl. When smoked, it feels like a wake-up shot to the head, not unlike an espresso, which makes this smoke perfect as a pick-me-up during a long day of physical labor. Having said this, it is not recommended to smoke OG Kush before bed, as it is known to speed up the heart rate and keep the user awake.",
        "There is also another well known OG lineage that was developed in Northern California, and this story went something like this.. A guy – we’ll call him KushDawg for the sake of this story – living somewhere on the Northern California Pacific Coast was growing the original cut from San Fernando Valley, the birthplace of most herb carrying the “OG” label. One evening, KushDawg was hanging out at a local bar when another chap also sitting at the bar offered him a bowl of some very special weed. Intrigued, KushDawg accepted the offer. Once the chap opened the bag and the dank, pungent OG aroma lifted into the air, KushDawg knew immediately, unbeknownst to the chap, that this was in fact his own herb. As they toked the glorious herb, the chap rendered his own opinion as to the origin of the herb, saying that it was so great because it was “Mountain Grown.” KushDawg corrected the chap, “Naw man, this stuff is ‘Ocean Grown,'” meaning that the herb was actually grown indoors on the Pacific Coast."

    ]

}
