{
    "Name":"Pit Bull",
    "Info":"Stoney Girl Gardens",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"Sugar Plum x pure indica",
    "Genetics":"",
    "Flowering":"30-40 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "The indica-dominant Pit Bull strain begins with a trade: som P-91 seed from the university professor who created the P-91 strain. Stoney Girl was told that this strain was the government’s latest G-13. P-91 came from a program at a university in Southern California that supposedly did not exist. This grandfather of the Pit Bull’s paternal side was crossed with Stoney Girl’s own Berkeley Blues to become a strain called Sugar Plum. Sugar Plum, an award winner that placed first in the 2003 Oregon medical cannabis awards, is Pit Bull’s father. The Pit Bull mother, simply referred to as P-91, is a cross from Southern California, consisting of a G-13 mother crossed with Bull Rider.",
        "As the name suggests, Pit Bull is a rugged, tenacious strain. The plants are vibrant, vigorous, and mite resistant. Don’t mistake this stubborn determination for rigidity. Pit Bull is very pliable and obedient. She performs well in any environment and has great yields in any arrangement from a hydro closet to an outdoor farm. The Pit Bull plant is branchy with close nodes. When allowed to grow free, she forms a giant spherical bush that blooms with buds on every branch. A quick plant, she finishes flowering in an average of 6 weeks or mid-September outdoors when planted in June, even in the temperate climates of the Pacific Northwest. It is a bush indoors, and a giant tower out.",
        "During flowering, Pit Bull jumps right into action, forming open blooms covered in crystals during the first 2 weeks. The buds are large thick spheres covered in pom-pom hairs and oozing crystals. Buds have a medium density that is neither airy nor popcorn textured, but also not rock hard. The Pit Bull sugar leaves have so much crystal on them that they tend to curl. The fan leaves are large and wide and look like maple leaves. Pit Bull stays bright green unless it gets chilly in the garden – then she turns purple. The bases of the leaves are a passion purple. The branches are bright green with violet stripes highlighting the ribs.",
        "The Pit Bull’s hardiness and instinct for survival make it an ideal strain for the beginner, but the qualities will satisfy more elite tastes and impress on special occasions. The buzz is a heavy hitter that won’t be a top choice for the occasional recreational user, but is well suited for medicinal use or for experienced tokers. There is a body blissfulness and a heady intense mental component that can feel a bit like a gong has been rung inside the brain. Pit Bull is thoughtful and trippy, if a bit distracted at its height. The taste and smell profiles are complex and maintain flavors throughout, including a fresh grapefruit citrus with honey, hash, and a pungent sweet tropical bass."

    ]

}
