{
    "Name":"Posh",
    "Info":"Cash Crop Ken",
    "Type" : "Indica 85 / Sativa 15",
    "Origins":"Honey Pot Kush x Kish",
    "Genetics":"",
    "Flowering":"50 days",
    "Harvest": "late September",
    "Potency":"",
    "Contents":[
        "Take the nuggety berry of Kish and cross it with a Honey Pot mother and Posh is what you get. This is a plant bred for good taste and a deep, stress-relieving stone.",
        "This mostly indica hybrid grows fast, tripling in height after the flip from vegetative to flower phase. She rises up like an evergreen tree with elongated, flexible branches that bend back, making some type of support or tying system advisable in order to maintain an even dispersal of light to the buds.",
        "This Canada native, like its Honey Pot mother, is super easy to clone, with a fast recovery time and a good rate for success. However it is inadvisable to stress this plant. Posh is a bit finicky about her environmental conditions. This tall thin supermodel will suffer if the temperature undergoes any big changes, and may become unstable or exhibit hermaphroditism. if she is accidentally exposed to drastic shifts in the rhythms of the grow room, the breeder advises that the main stalks be checked for pollen sacs in order to avoid accidental pollination> For this reason, Posh may be more suited to a gardener with a bit of experience in controlling conditions.",
        "If raised right, Posh can deliver some explosive colas that compare to the size of a two-liter bottle. Yields are close to a pound per 1000 watts of light in SOG. The willowy nature of this plant makes her easy to manicure, and the buds retains enough of the nugget-like solidity of the Kish parent to weigh in for a satisfying yield. At ripeness, they often take on tinges of purple, and give off a strong pine fragrance.",
        "The Posh buzz is devastating. Her strong head / body combo make this an ideal late night smoke. The high creeps into an intense mind-boggling sensation that is effective for disrupting persistent or cycling thoughts and giving the psyche a rest. While in daytime or active situations this might be disorienting or immobilizing, at night it can be a fantastic and smooth sendoff to slumber."

    ]

}
