{
    "Name":"Romulan",
    "Info":"Federation Seed Company",
    "Type" : "Indica",
    "Origins":"Cali strain x White Rhino",
    "Genetics":"",
    "Flowering":"56-60 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "Federation purchased Romulan as a complete strain in 1996in an attempt to rescue it from extinction. In the 1970s, this variety was brought from California to British Columbia by a Vietnam veteran, where it was grown on Vancouver Island. This variety was nicknamed Romulan after people joked that the high “could dent your head,” producing ridges like those of Star Trek’s warrior-like race with the same name.",
        "Federation acquired Romulan in the form of clones, so she was entirely female. After crossing it with a Cannabis Cup prize winner, a White Rhino male, breeders ar Federation backcrossed 11 times to stabilize the variety at a 97 percent pure Romulan hybrid. Selections at each backcross favored the biggest, most robust plants over the fastest, although the finishing time remains around a very acceptable 8 weeks. Romulan seeds are now homogenous and have an improved robustness and yield as a result.",
        "This purple-stemmed plant branches extensively and is less appropriate for a sea of green garden than a set-up which takes advantage of the multiple branching and budding sites. A completely indica plant, Romulan is short and bushy with dark green leaves and thick buds. While still a moderate producer, Romulan has not lost its head-denting capabilities, and claims the title of Federation’s most potent strain. Outdoors, this plant will yield about a half-pound of tight nuggets per fully grown plant. Drier climates are more favorable since the buds, being both thick and dense, have some susceptibility to mold.",
        "Romulan is alien pot with potent effects. Couch lock is likely an concentration may be difficult to maintain. Medically, this indica weed has shown excellent results for chronic pain.In addition to its ongoing popularity in BC, Romulan has developed a devoted fan base in Texas."
    ]

}
