{
    "Name":"",
    "Info":"",
    "Type" : "",
    "Origins":"",
    "Genetics":"",
    "Flowering":"",
    "Harvest": "",
    "Potency":"",
    "Yield":"",
    "Contents":[
        "A truly classic strain, AK-47 has been around since the early 1990s. This sativa dominant hybrid was reworked and stabilized by Serious Seeds in 1999. Since then, AK-47 has won multiple Cannabis Cups and awards, and her genetics have been used to create crosses by many cannabis breeders.",
        "A relatively small but influential seed company, Serious Seeds provide product to many of the Amsterdam coffeeshops. Thanks to this, as well as their penchant for creating varieties that blow others out of the waster, their strains have been much sought after. AK-47 is one of their most infamous strains, and for good reason; as well as being a complete knockout high, it is parent to many modern strains, including the auto flowering Cetme from Pit Bully Seeds and Serious Seeds’ own White Russian.",
        "AK-47 is a complex mix of Colombian, Mexican, Thai, and Afghani genetics that only a master breeder like Simon from Serious Seeds could manage. It is one of the most well-known contemporary strains and one of the most hard hitting – it’s no coincidence that it was named after the most lethal rifle in the world.",
        "It’s a common misconception that the strongest of the most famous strains are harder to grow, and AK-47 banishes this myth by being particularly simple to cultivate. It can grow in any environment but prefers indoor setups, where it will grow out in 10 days from clone. These seedlings will only ever get to a medium height, making a lack of space not a problem. Their growth is vigorous, however, and if you plan on topping, you’re going to need to give the plants some support as they mature.",
        "A flowering time of 60 days is usual, and from this you can harvest up to 500 grams per square yard of grow room. The compact nugs are a sight to behold, with a thick coat of crystals and hardly any leaves, and it’ll be tough to keep your hands off them until they’ve properly cured!",
        "One thing to consider when growing AK-47 is that the closer your buds get to harvest, the more they will stink. And I’m not talking a bit of a stench in the hallway, I’m talking the neighbors in the next street getting high off the smell. Don’t worry though, some carbon filters should sort that right out, but when you start your grow, be aware that odor might be an issue and choose a grow space accordingly.",
        "Like its namesake, AK-47 has very powerful effects, but rather than knocking you down brain dead, it will leave you with a nice, balanced high, affecting both head and body, although if you carry on toking, you’ll find yourself with a serious head high. It’s definitely a one hit wonder, though, and even if you are a daily smoker, you’ll be left a little blown away by its potency."
        

    ]

}