{
    "Name":"SnowStorm",
    "Info":"Dutch Passion",
    "Type" : "Indica / Ruderalis",
    "Origins":"Afghani Master Kush x Ruderalis",
    "Genetics":"",
    "Flowering":"45-60 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "SnowStorm is a potent indica-ruderalis hybrid in the Dutch Passion “autofem” family. This autoflowering, feminized strain was the culmination of a two year breeding project, successfully partnering a special ruderalis strain with Afghani Master Kush indica. The Master Kush parent is originally from the Hindu Kush region of Afghanistan, and SnowStorm has harnessed its power into a fully automatic strain that progresses from start to finish in only 9-10 weeks. Named for its sticky, resinous, snow-dusted appearance at maturity, SnowStorm may just give you that special giddy Christmas -morning anticipation as it reaches harvest time.",
        "This indica strain is a strong and sturdy, low-maintenance plant that new or hobby growers will find quite manageable. Because its feminized, no gender selection is necessary, and the autoflowering characteristic removes the need for maintaining strict light cycle phases during growth. These qualities make SnowStorm a highly adaptable choice suitable for many circumstances. Plants can be grown indoors, where they thrive under a 20-hour on / 4-hour off cycle. Outdoors, this strain only needs two months of summer weather to grow from seed to maturity. Seeds grow for 2 weeks, and then automatically switch to flowering, maturing after 7 additional weeks.",
        "SnowStorm loks rather like a traditionally shaped Christmas tree plant, finishing at an average height of 20 inches. The leaves are of indica heritage with broad fingered leaflets. SnowStorm’s buds have a semi-compact structure and exude a sticky frosting of resin that resembles a brush of winter snow. Given their modest size, these plants deliver impressive yields with 1 ounce average and a 2 ounce maximum yield of high-quality marijuana plant.",
        "SnowStorm has a smooth yet sweet aroma with hints of citrus and fruit. The smoke is earthy and rich. This strain’s sticky coating contributes to its potent stone, which induces a pleasant and relaxed contentedness. The indica characteristic of the high does not motivate vigorous activity, but if relaxed receptiveness is the desired mood, SnowStorm can certainly elevate the appreciation of music, art, food, and the companionship of friends."

    ]
}
