{
    "Name":"Somalicious",
    "Info":"Soma’s Sacred Seeds",
    "Type" : "Indica",
    "Origins":"LA Confidential x Lavender",
    "Genetics":"",
    "Flowering":"70 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "This all-indica strain is not only delicious, it is Somalicious. If you follow the breeding scene, you may already know that Soma strains have a reputation as heavenly headstash that deliver on taste. Soma’s reverence for the delicious is also evident in his dedication to growing with organics in soil. So when Soma says that Somalicious is one of the tastiest strains he’s ever developed, it is a safe bet to say this variety is going to deliver some fantastically dank flavors.",
        "The Somalicious mother is the LA Confidential developed by DNA Genetics. LA Confidential swept many awards in the mid-2000s and gathered a celebrity following. This mother plat truly captures what kush is meant to be, deriving from an OG Kush line. The stone is surprisingly energetic and super potent, closely mimicking a hash-type high. In Somalicious, this mother has been crossed with Soma’s Lavender strain, an Afghani-strong strain that combines Super Skunk, Big Skunk Korean, Afghani, and Hawaiian for another strong hash-flavored contender. Lavender’s name comes from the intense purple coloration this plant acquires over the course of flowering.",
        "Somalicious has carried Lavender’s purple genetics through, turning a vivid to dark purple over the growing cycle. This strain can be grown indoors or out, and is best as a multi-branch plant, since it stays fairly short (3 feet / 1 meter) and trains fairly easily when staked or super-cropped. Outdoors, Somalicious finishes at the beginning of October at an average height of 6 feet (2 meters).",
        "The flavors deliver the extreme hashiness of the parents with a mixture of sweetness and pleasantly lingers on the tongue for quite some time after smoking. The maximize the chocolate earthy goodness, Soma recommends soil with organic guano as the main flowering fertilizer. However, Somalicious delivers on more than the taste of buds. The high evokes a serene, yet luminous state of mind that seems to awaken a broad, almost philosophical sense of acceptance and love for what is. The stress of the modern world is swept away with this change in perspective. A little Somalicious can make the path to kindness and patience easier to find. It is the kind of high that brings a smile and a good belly laugh. While it is terrific for enhancing enjoyment of music, it seems to make bad music sound much worse. Those who discover this strain often seek it out. The only challenge with this strain may be making sure there’s enough to last."

    ]
}
