{
    "Name":"Southern Nights",
    "Info":"Fast Seed Bank",
    "Type" : "Indica",
    "Origins":"Afghani x Afghani",
    "Genetics":"",
    "Flowering":"45-50 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Nights in the South are dark, lush, and sultry. In summer, they offer respite from the relentless heat and humidity of southern weather, often bringing renewed mental and physical energy with the cool night breeze. This all-indica Afghani embodies these qualities. Like most pure indica strains, Southern Nights plants are hardy and compact, but they take time to gain size during vegetation. They need a month of vegetation for optimal yields.",
        "When the plants have filled out, the Afghani parentage confers a fast flowering time. Southern Nights speeds through flowering in an average of 6-7 weeks. This robust plant performs well in hydro or soil, and adapts well to a sea of green setup. Outdoors, average flowering times are 45-50 days, finishing at the end of September in Mediterranean latitudes.",
        "At the point when plants are forced to flower, it is good to rim off the lower branches and go easy on the fertilizer until they gain some size. Once growth has been established, Southern Nights resembles a compact Christmas tree with thick dark green foliage. If the leaves aren’t dark and dense, the plants need more feeding. This strain is good for a beginner, but gardeners should keep a close eye on pH balance and watch for signs of nutrient buildup until they get a handle on the right fertilizer and nutrient balance. Organic fertilizers are best.",
        "Southern Nights can handle a wide range of temperatures well. As long as the space is adequately ventilated and in a reasonable temperature range, these plants have a strong resistance to pests and do not develop a strong odor. Plants flowered at 3 feet (1 meter) finish at 4-5 feet (1.2-1.5 meters). the buds are rock hard with resinous silver-green calyxes and thick white hairs that turn coppery brown at maturity. Yields max out at 450 grams per square meter. Clones taken from the Southern Nights plants root well and fast.",
        "The finished buds make attractive green-gray stash with an earthy green smell and flavor. The Southern Nights high is its most enviable trait – a positive mind-body effect that is great at any time of day and agrees with many types of people and personalities. It is positive and relaxing enough to be a welcome guest at the dinner party. The first thing most people notice is its fast-acting body effect. it encourages activities that stimulate the sense in a hands-on way. This may involve acting on a creative impulse, going for a hike, or indulging in other sensual appetites. When the stash is cured for 2-3 months, Southern Nights also serves as good medicine for relief from chronic pain.",

    ]
}
