{
    "Name":"Speed Queen",
    "Info":"Mandala Seeds",
    "Type" : "mostly Indica",
    "Origins":"Himachal Pradesh, North India",
    "Genetics":"",
    "Flowering":"55 days",
    "Harvest": "mid September",
    "Potency":"",
    "Contents":[
        "Speed Queen is a tough indica strain known for her fast flowering time and early resin production. With an easygoing temperament, this strain is a good choice for novice growers. She is also good for sea of green gardeners who want to maximize the crops they can produce in a year.",
        "Speed Queen is resilient in rough outdoor weather, finishing in mid September in southern latitudes. In cooler climates, expect ripening to take an additional 2 weeks. For indoor cultivation, the breeder recommends growing a screen of green, or topping the plants. Given extra vegging time, the adequate pot size, topped Speed Queen plants will grow a forest of enormous colas. Indoor grows reach harvest in a fast 8 weeks. Due to her vigor and thick stems, this strain also delivers quality cuttings over a long period of time as a mother plant.",
        "Speed Queen has resistance to spikes in heat. She forgives the occasional mistake in plant care and grows robustly with good soil with low levels of feeding. This strain is a boon for people with little time or energy for their garden. Harvesting and trimming is a quick operation since all buds grow chunky. The bud leaves and even the sun leaves are covered in frosty trichomes, which are good for hashish. One phenotype has the delicious aroma of orange and citrus. The other mixes fresh fruitiness with a more pungent / skunky note.",
        "The aromas transform to a sweet or fresh-fruity smell and flavor once the buds are cured. Compact, resiny, and pleasant smelling, her buds have great “bag appeal”. For an indica, Speed Queen has a surprisingly stimulating and balanced mind-body high that does not put you to sleep. Mandala refers to this strain as the “surfer’s choice”. Surfers are true connoisseurs who sample a lot of fine grass at the world’s best surfing spots. They like to stay on their feet, on the board or at a party. The “surfer’s choice” is a potent, sociable buzz that you can ride like a wave. The high comes on quickly and is pleasantly relaxing, yet leaves plenty of energy for enjoying a full moon party, or just watching the waves roll in."
    ]

}
