{
    "Name":"Stargazer",
    "Info":"Delta-9 Labs",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"Warlock x AK-47 x Sensi Star",
    "Genetics":"",
    "Flowering":"60-70 days",
    "Harvest": "early October",
    "Potency":"",
    "Contents":[
        "Stargazer is an indoor strain from a family of strong, stoney connoisseur pot. her mother hybridizes the indica-dominant Warlock and the sativa-dominant AK-47, both noted for fast, stimulating, and slightly hashy highs. her Sensi Star father is likewise popular for its fast indica body stone with a side dish of mental stimulation. between them, Stargazer’s three immediate ancestors boast an average THC content of 20% and have won eleven major awards, including the High Life and high Times Cannabis Cups. As her name suggests, Stargazer was bred for intense, alert effects that are felt in both the mind and body; for happily gazing at the stars on a night ramble or gazing into a dance partner’s eyes.",
        "In its recommended indoor setting, Stargazer takes between 8 and 10 weeks to flower, depending on temperature. She likes cold temperatures more than most plants do, which might make her a good candidate for outdoor planting in the northern latitudes. Typically, though, Stargazer grows well in densely planted soil or hydro. Her Skunk and Afghan dominated genes lead to extensive branching, but sea of green cultivation is possible with some pruning. Stargazer’s internodes are close together, sprouting thin, whip-like branches that may require support once the buds begin to reach their full density. Her short, thick leaves are speckled with the oh-so-feminine pink hairs characteristic of her Warlock and AK-47 mother-line.",
        "While she blossoms, Stargazer’s scent is strong and leans toward pungency. Once cured, the palate is hard to describe – in the background, creamy and slightly sour body; in the foreground, a bite of Sensi Star’s lemon flavor pushed toward the astringent and minty. Delta-9 suggests that this sour-sweet mixture tastes a bit like a peppermint breath candy."

    ]
}
