{
    "Name":"The Kali",
    "Info":"Big Buddha Seeds",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"OG landrace",
    "Genetics":"",
    "Flowering":"56-70 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Kali, the dark and fierce Hindu goddess, is a powerful force, bringing change. In the ying-yang of Eastern cultures, this goddess is both destructive and creative, nurturing and protecting her children, but also defending them with violent ferocity. In Tantric beliefs, Kali is a dominating force, foremost among the goddesses. her name in Tantra expands to also mean the original form of all things, or ultimate reality. Kali is usually portrayed as a many-armed dark-skinned blue or black goddess with glittering eyes and a fearsome extended tongue.",
        "The strain known as “The Kali” originates from the Afghani / Pakistani border. It is a landrace OG Kush that was selfed with a reversed Kali clone father taken from seeds whose male was responsible for the original backcross that led to the Cup-winning Big Buddha Cheese. Kali is from old-school indica parents, the real hashmaking deal from the home of ancient hashmaking tradition, an area that has selected for hash excellence among its plants over generations upon generations.",
        "The Kali is a dark fierce-growing indica strain that has thin dark green leaflets and very little but very sturdy branching, especially for such an indica-influenced plant. She like moderate to heavy feeding and will do well in any substrate from soil or coco t hydro. The Kali is not a large plant, usually entering flower at 2 feet and finishing between 4-6 feet. The Kali is not a large plant, usually entering flower at 2 feet and finishing betweet 4-6 feet. The Kali stands up well to heat or cold and is good for growers at all levels of experience. The yield on this plant are good indoors or out, with each plant easily delivering a kilogram (2.2 pounds) if treated with respect. The buds are conical and as resinous as you’d expect from a hash-derived strain.",
        "The Kali has a dark hash smell in the garden and throws out buds like fat feathered goddess tongues. The buds glisten with rich layers of THC, the dense ambrosia of this goddess plant. Kali is an obvious choice for hashmaking. Cured buds will also have a very hashish-like flavor and aroma, dense and smooth, with a unique, earthy citrus-kush richness. This is slow trajectory pot, with a flow of euphoria and creeper body stoniness. The Kali is the manifestation of Kundalini energy, which is one’s dormant energy force that lies at the base of the spine and, when awoken, restores vitality. Kali brings awakening in her dark tasty form, and her delights will make her a savored addition to any collection."

    ]

}
