{
    "Name":"The OG #18",
    "Info":"DNA / Reserva Privada",
    "Type" : "Indica",
    "Origins":"OG Kush S1",
    "Genetics":"",
    "Flowering":"63 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "The OG #18 was selected from a set of the original feminized OG Kush seeds. After a little time with the OG #18, it was clear that she was a keeper phenotype with many good and winning qualities, leading DNA to feminize her. Compared with the original OG Kush, this indica strain takes on a more sour taste reminiscent of the fuel-sour tones of the Chem Dawg, but with the OG-Chem power.",
        "The OG #18 also makes better use of the space than her predecessors, averaging better yields than OG Kush – a third more on average. This plant branches a lot and will stretch a little during the vegetative phase, but when the roots hit bottom, OG #18 growth takes off, spreading out into a bush and doubling in size. DNA recommends pinching to direct growth. The buds are bigger than OG Kush, and they get rock hard as the plant nears ripeness. beware of spider mites as they seem to be attracted to the OG #18, but even with the compact bud structures, molds aren’t a problem. These plants bounce back from nutrient faux pas easier than some. However, OG #18 will become unhappy in hot rooms or climates. At 9 weeks, The OG #18 buds are mature and become little beauties that twinkle with a sheen of resin.",
        "The OG #18 is a musky strain that gives off a scent from the get-go, and the odor only gets more intense during the flowering period. The final cured buds transform this muskiness into a tasty Kush flavor with a sour undertone. The high is long lasting and trancey. The OG #18 is tunnel vision pot that washes out peripheral vision. The high feels like a bubble has been stretched around you. When the bubble pops, it is as if the high caused time to warp. The clock doesn’t seem to match the perception of how much time has passed. These qualities make OG #18 optimal for focused leisure such as playing video games, but a terrible idea for driving or staying on schedule. The OG #18 won the 2009/2010 High Times Cannabis Cup in the Indica Category for the Reserva Privada series. She also won the 2010 Europe Champions Cup and 2010 Spannabis Indoor Hydro Cup."

    ]
}
