{
    "Name":"The Doctor",
    "Info":"Green House Seed Co.",
    "Type" : "Indica 80 / Sativa 20",
    "Origins":"Great White Shark x South Indian x Super Skunk",
    "Genetics":"",
    "Flowering":"56 days",
    "Harvest": "early September",
    "Potency":"",
    "Contents":[
        "Valentino Rossi may be one of the greatest motorcycle racers of all time. Now, in his late 20s, he has come to dominate the sport in a decade of riding, claiming seven World Champion titles in the Grand Prix racing circuit. Although he’s been known by a few nicknames, “Rossifumi” and “Valentinik” among them, most people simply call him “The Doctor”. As you may have guessed, this Green House strain is named as tribute to Rossi. Like her motorcycle racing namesake, The Doctor’s stone blasts on the scene, hitting quick and hard reverberating through the head and body with an intensity that might encourage couchlock. This is zero-to-one-hundred fast accelerating indica.",
        "A champion producer, this mostly indica strain generates the heaviest, most dense bud of Green House Seed’s collection. besides being a powerhouse of production and stone, The Doctor is also an easy-to-grow plant that performs well for beginners and experienced growers alike. Soil-based setups will deliver sweeter tastes, but hydro delivers a bigger yield. Outdoors, this variety matures properly in temperate and Mediterranean zones as well as in subtropical regions, finishing around the end of September in the Northern hemisphere.",
        "The Doctor is a bushy, indica-dominant plant that requires trimming to clear away her lower branches, and prefers 2 square feet of space per plant. This variety enjoys generous feedings, especially in hydroponics systems. Green House recommends adding extra phosphorous and potassium about midway through flowering, in week 4, in order to maximize flower development. EC levels should not exceed 2.4 in hydro and 2.0 in soil.",
        "The buds on this plant may remind you of primitive totems peeping out of a jungle. Massive colas jut out from the dark green leaves, looking oddly out of proportion to the short bushy stature of the plant. Rounded calyxes shoot in all directions from the cola profile. The flavor is sweet, earthy indica with a skunky background."

    ]

}
