{
    "Name":"Tora Bora",
    "Info":"DNA / Reserva Privada",
    "Type" : "Indica",
    "Origins":"LA Confidential x pure Pakistani",
    "Genetics":"",
    "Flowering":"56-63 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "The Tora Bora is a peaceful meeting of pure Pakistani and pure Afghani. This cross of two legendary indicas results in a great stash of bluish-green knockout nugs for the high tolerance smoker.",
        "The award-winning LA Confidential mother strain originated from an Affie clone. She is known for being dark, dank green plant that grows slowly in vegetative phase and produces modest per-plant yields of connoisseur, heavy Kush favored indica tastiness. The Pakistani X-18 father is an early stretching plant that slows to a more indica pattern in flowering and finishes with chunky pungent blue-hued nuggets. Both parent plants are known as strong medicinal indicas with a history of relieving pain and helping patients with insomnia. The combination of the two results in a vigorous, fast finishing plant that is crytal coated with good medicine.",
        "Average yields of the Tora Bora improve on the mother and make this strain a good candidate for small gardens as well as larger grows. This is a plant for the indica flavor fan, and to bring out the most, soil and organic deliver better flavor intensity. The Tora Bora plant has the typical wide, dark foliage of an indica and forms one main cola, with average side branching. Pinching or topping will help with yields. This plant can handle cold weather as long as there is no frost. Final heights will only be about 1 1/2 times the height at flower forcing, so breeders recommend these plants vegetate for as long as possible to help beef up size and yield. Tora Bora will gobble up nutrients like a fat lady at an all-you-can-eat buffet. She isn’t particularly sensitive about nutrient levels and is fairly forgiving, making her a good strain for a novice grower to learn on. However, the potent indica punch of the final product may make this strain more intriguing for medicinal marijuana users of veteran indica smokers who know they want big stone effects.",
        "The smell of the Tora Bora is not overwhelming when it is growing, but the buds get so Velcro-sticky with resin that even barely brushing against one will superglue down arm hair, and release aromas as you tug free. Tora Bora delivers a pleasing yield of greenish-blue and hashy-sweet indica depth. This strain will bring on a strong body relaxation and may cause some conspicuous eye droop. Medicinally, it is good for insomnia."

    ]

}
