{
    "Name":"Tundra",
    "Info":"Dutch Passion",
    "Type" : "Indica / Ruderalis",
    "Origins":"Passion #1 x ruderalis",
    "Genetics":"",
    "Flowering":"56-63 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "The tundra is a geographic region with a short growing season, and plants that grow in the tundra biome typically hug the ground and show great hardiness to withstand rugged weather. Many people associate tundra with a sense that has been dusted with frost. The Tundra variety embodies both of these qualities, forming a compact hardy plant that becomes frosty with a snow of trichomes at maturity.",
        "This autoflowering strain was developed from the champion Dutch Passion outdoor indica strain, Passion #1. Passion #1 is a strain that originated in California during the 1970s, and was refined to become a sturdy pest and disease resistant outdoor indica strain. Dutch Passion started a breeding program to introduce the autoflowering ruderalis to traditional strains, and found that some gave especially strong results, Passion #1 among them. Breeders worked carefully to formulate an autoflowering version of the Passion #1, utilizing ruderalis and other strains as needed to stabilize a hybrid that retains the desirable potency and balanced high of the Passion #1 with the genetics to flower automatically without a carefully controlled light regimen.",
        "This healthy, easygoing variety can be grown almost anywhere. Outdoors, Tundra seeds can be planted as early as the start of spring or as late as August and will automatically start and complete the flowering process, leaving you the proud owner of a Tundra harvest in 56-77 days from the time the seed sprouts until the buds are finished. Tundra will also deliver excellent results indoors under a cycle of 20 hours light / 4 hours darkness. The genetics from Passion #1 have passed on an excellent resistance to mold and bud rot.",
        "Tundra grows a compact, strong, and vibrantly green bush with limited branching. It stays short and matures quickly, growing vegetatively for just 2 weeks when it reaches a height around 2 feet (50cm). Then Tundra automatically enters flowering, which takes an additional 6-9 weeks. Plants finish at heights of around 3 feet (80cm) with an average yield of 1-2 ounces (25-50g) per plant.",
        "The Tundra buds are firm and rich in THC crystals. The high is a pleasurable blend of body relaxation and moderate “up” effects. If you plunge your nose ino a baggie of buds, the aroma is thick and sweet with a citrus edge. The soft smoke smells of spices mixed with an astringent fruity quality of lemons and grapefruits. Tundra allows one to drift freely in a happy state of relaxation, translating well to a calm enjoyment while socializing with frineds or to leisurely solo activities such as peaceful afternoon in a hammock."

    ]

}
