{
    "Name":"Vanilla Kush",
    "Info":"Barney’s Farm",
    "Type" : "Indica",
    "Origins":"Origins: Kashmir x Afghani",
    "Genetics":"",
    "Flowering":"60-65 days",
    "Harvest": "",
    "Potency":"",
    "Contents":[
        "Vanilla Kush brings out creamy vanilla flavors in this pure indica Kush. The mother is a hash plant from Kashmir, a valley in the Himalayas of the northwestern Indian subcontinent. This region is a traditional hashmaking region, and the mother plant is a landrace variety of high quality coming from the cannabis motherlands. The cross is with a Hindu Kush father, a landrace strain of Afghanistan origin. When combined, these two heritage indica strains created a flavorful and highly potent kush.",
        "Landrace kush strains are consistent plants with a strong, steady growth pattern. Vanilla Kush likes to branch and typically forms eight symmetrical side branches. This strain delivers happier, more abundant yields when cultivated as multi-branch plants. The solid growth adapts well to hydro or soil systems, and thrives when a SCROG setup is used. When grown indoors, plants typically finish at a height of around 2 feet (60 cm) and take roughly 9 weeks to flower. Outdoors, these plants finish at the end of September. With two months’ flowering time, outdoor plants can yield up to 8 ounces (250g) apiece.",
        "Vanilla Kush is an iconic, medium-dark plant that stays green throughout and only fades in color as the buds finish. The leaves have thick velvety leaflets with a heavy sugar coating of trichomes hugging close to the leaf base. The glands darken into little globules of red and gold as the plant reaches maturity, and the hairs take on a bright burnished orange hue. Kushes are known to form large, sturdy, and dense colas, and Vanilla Kush is no different. It is notably distinct due to its intensely rich aromas, mixing mixing herbal smells of lavender with the deeper tones of vanilla bean and some acrid accents of citrus peel.",
        "Vanilla Kush placed second in the 2009 overall Cannabis Cup, an accolade that speaks to its appealing combination of creamy flavors and potent effect. Kushes are known for their high THC levels, and this strain delivers a potent and long lasting high that is particularly strong in its physical effects. Vanilla Kush is also a standout on taste. The strong, sweet herbal-floral notes dominate the smoke. This strain induces a strong sense of relaxation, easing muscle tension, which appeals to many medical marijuana users. In smaller amounts, the mental effect is euphoric and thoughtful, yet relaxed. Heavy indulgence strengthens the effects, leading to a trippy and potentially sleepy tunnel vision that may cause couchlock or napping."

    ]

}
