{
    "Name":"Wappa",
    "Info":"Paradise Seeds",
    "Type" : "Indica",
    "Origins":"indicas",
    "Genetics":"",
    "Flowering":"55-60 days",
    "Harvest": "mid October",
    "Potency":"",
    "Contents":[
        "Wappa is a stout-statured and stable indica strain variety. She adapts well to the wet climates of Northern Europe, such as Belgium and Holland, but she really thrives in sunnier regions like France or Spain. She also achieves excellent results indoors, regardless of the growing medium. Wappa’s short indoor size makes her a good choice for gardeners with limited room. Her unique stone offers indica body relaxation without stupor or couchlock.",
        "Wappa is a feminized variety: pollen was obtained from a female manipulated to produce male flowers, so all of Wappa’s seeds will produce females. She is a robust plant that quickly becomes the darling of the grow room because of her attractive appearance, easy in cultivation and fast ripening yield. Her broad leaves shine with lime-green helthiness. She starts a bit slowly, but soon gets her pace, turning into a picture-perfect little spruce with once main stem. When forced to flower at 1 foot, she doubles in size by maturity, producing big chunky colas that fill the air with sweet aromas of fruits and sugar. Wappa has a high calyx-to-leaf ratio, which makes her a breeze to manicure. She finishes flowering in about 8 weeks, by which time her buds and the neighboring leaves will be coated in resin that smells like marshmallows. This variety produces about half a kilogram of buds per square meter indoors, or roughly the same amount per plant, outdoors.",
        "Wappa’s fruity nugs are great head candy. her THC has been measured at over 18% on all samples, making for an intense high. the buzz comes on strong, but with a pleasant rather than jarring onset. It is a lumnous high that nudges open the doors of perception. After a few hours, the heightened awareness fades off slowly, leaving an appreciation for the mini-vacation that Wappa has created. Even though she is a full indica, Wappa does not weigh down the body or create couchlock for most people. She taps into an active, aware body vibe, more conductive to merrymaking than couch surfing."

    ]
}
