{
    "Name":"White Berry",
    "Info":"Paradise Seeds",
    "Type" : "Indica 75 / Sativa 25",
    "Origins":"indica x indica / sativa",
    "Genetics":"",
    "Flowering":"45-50 days",
    "Harvest": "early October",
    "Potency":"",
    "Contents":[
        "White Berry is a happy-go-lucky plant that is very fast to flower and particularly well suited to sea of green grows. Because her seeds have been feminized, White Berry plants are all-female, with no sexing required. When this variety was tested, none of her seeds showed hermaphrodite tendencies – there was not a single male flower formation among these ladies.",
        "White Berry is model marijuana strain, slender and medium in height, with fresh green good looks and single-cola dominance and homogeneity between the plants that will endear her to sea of green gardeners. These plants come up in a uniform pattern that makes growing and budding as easy as growing from clones. The White Berry calyx-to-leaf ratio is good news for weed manicurists, because she is easy to trim. Her smaller leaves are also worth recycling for excellent hashish.",
        "In her short 7-week flowering phase, White Berry becomes bejeweled with trichomes that frost her buds, and she generates a decidedly berry perfume that leaves no doubt about the appropriateness of her name. Some calyxes may turn purple, giving them an exotic and mouthwatering appearance. Although the buds will look as if they are on the verge of ripeness at 6 weeks, it is best to leave them another 10 days to allow the cannabinoids to reach their peak. By then, the ripened buds will add a fresh astringent lemon to the unmistakable berry scent, like a mixture of berry jam and citrus. The flowers will have bulked out, achieving yields in the 400-500 grams per square meter range.",
        "White Berry’s hybridized genetics create a complex and versatile smoke. The typical result is a crystalline sativa head high, complimentary to most lightweight activities. Yet when smoked in higher quantities, an indica-style stone comes forward, like a warmth radiating over the smoker’s torso and limbs.Tokers who smoke lightly throughout the day, but want a deeper stone at night, may find that White Berry meets all their needs in one attractive, easy-growing package."

    ]

}
